espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** GPIO_STRAP_REG register
 *  Strapping pin register
 */
#define GPIO_STRAP_REG (DR_REG_GPIO_BASE + 0x0)
/** GPIO_STRAPPING : RO; bitpos: [15:0]; default: 0;
 *  Represents the values of GPIO strapping pins. (need update the description, for
 *  example)
 *
 *  - bit0: invalid
 *  - bit1: MTMS
 *  - bit2: MTDI
 *  - bit3: GPIO27
 *  - bit4: GPIO28
 *  - bit5: GPIO7
 *  - bit6 ~ bit15: invalid
 */
#define GPIO_STRAPPING    0x0000FFFFU
#define GPIO_STRAPPING_M  (GPIO_STRAPPING_V << GPIO_STRAPPING_S)
#define GPIO_STRAPPING_V  0x0000FFFFU
#define GPIO_STRAPPING_S  0

/** GPIO_OUT_REG register
 *  GPIO output register
 */
#define GPIO_OUT_REG (DR_REG_GPIO_BASE + 0x4)
/** GPIO_OUT_DATA_ORIG : R/W/SC/WTC; bitpos: [31:0]; default: 0;
 *  Configures the output value of GPIO0 ~ 31 output in simple GPIO output mode.
 *  0: Low level
 *  1: High level
 *  The value of bit0 ~ bit31 correspond to the output value of GPIO0 ~ GPIO31
 *  respectively. Bitxx ~ bitxx is invalid.
 */
#define GPIO_OUT_DATA_ORIG    0xFFFFFFFFU
#define GPIO_OUT_DATA_ORIG_M  (GPIO_OUT_DATA_ORIG_V << GPIO_OUT_DATA_ORIG_S)
#define GPIO_OUT_DATA_ORIG_V  0xFFFFFFFFU
#define GPIO_OUT_DATA_ORIG_S  0

/** GPIO_OUT_W1TS_REG register
 *  GPIO output set register
 */
#define GPIO_OUT_W1TS_REG (DR_REG_GPIO_BASE + 0x8)
/** GPIO_OUT_W1TS : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to set the output register GPIO_OUT_REG of GPIO0 ~ GPIO31.
 *  0: Not set
 *  1: The corresponding bit in GPIO_OUT_REG will be set to 1
 *  Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to set GPIO_OUT_REG.
 */
#define GPIO_OUT_W1TS    0xFFFFFFFFU
#define GPIO_OUT_W1TS_M  (GPIO_OUT_W1TS_V << GPIO_OUT_W1TS_S)
#define GPIO_OUT_W1TS_V  0xFFFFFFFFU
#define GPIO_OUT_W1TS_S  0

/** GPIO_OUT_W1TC_REG register
 *  GPIO output clear register
 */
#define GPIO_OUT_W1TC_REG (DR_REG_GPIO_BASE + 0xc)
/** GPIO_OUT_W1TC : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to clear the output register GPIO_OUT_REG of GPIO0 ~
 *  GPIO31 output.
 *  0: Not clear
 *  1: The corresponding bit in GPIO_OUT_REG will be cleared.
 *  Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to clear GPIO_OUT_REG.
 */
#define GPIO_OUT_W1TC    0xFFFFFFFFU
#define GPIO_OUT_W1TC_M  (GPIO_OUT_W1TC_V << GPIO_OUT_W1TC_S)
#define GPIO_OUT_W1TC_V  0xFFFFFFFFU
#define GPIO_OUT_W1TC_S  0

/** GPIO_OUT1_REG register
 *  GPIO output register
 */
#define GPIO_OUT1_REG (DR_REG_GPIO_BASE + 0x10)
/** GPIO_OUT1_DATA_ORIG : R/W/SC/WTC; bitpos: [31:0]; default: 0;
 *  Configures the output value of GPIO32 ~ 63 output in simple GPIO output mode.
 *  0: Low level
 *  1: High level
 *  The value of bit32 ~ bit63 correspond to the output value of GPIO32 ~ GPIO63
 *  respectively. Bitxx ~ bitxx is invalid.
 */
#define GPIO_OUT1_DATA_ORIG    0xFFFFFFFFU
#define GPIO_OUT1_DATA_ORIG_M  (GPIO_OUT1_DATA_ORIG_V << GPIO_OUT1_DATA_ORIG_S)
#define GPIO_OUT1_DATA_ORIG_V  0xFFFFFFFFU
#define GPIO_OUT1_DATA_ORIG_S  0

/** GPIO_OUT1_W1TS_REG register
 *  GPIO output set register
 */
#define GPIO_OUT1_W1TS_REG (DR_REG_GPIO_BASE + 0x14)
/** GPIO_OUT1_W1TS : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to set the output register GPIO_OUT1_REG of GPIO32 ~
 *  GPIO63.
 *  0: Not set
 *  1: The corresponding bit in GPIO_OUT1_REG will be set to 1
 *  Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to set GPIO_OUT1_REG.
 */
#define GPIO_OUT1_W1TS    0xFFFFFFFFU
#define GPIO_OUT1_W1TS_M  (GPIO_OUT1_W1TS_V << GPIO_OUT1_W1TS_S)
#define GPIO_OUT1_W1TS_V  0xFFFFFFFFU
#define GPIO_OUT1_W1TS_S  0

/** GPIO_OUT1_W1TC_REG register
 *  GPIO output clear register
 */
#define GPIO_OUT1_W1TC_REG (DR_REG_GPIO_BASE + 0x18)
/** GPIO_OUT1_W1TC : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to clear the output register GPIO_OUT1_REG of GPIO32 ~
 *  GPIO63 output.
 *  0: Not clear
 *  1: The corresponding bit in GPIO_OUT1_REG will be cleared.
 *  Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to clear GPIO_OUT1_REG.
 */
#define GPIO_OUT1_W1TC    0xFFFFFFFFU
#define GPIO_OUT1_W1TC_M  (GPIO_OUT1_W1TC_V << GPIO_OUT1_W1TC_S)
#define GPIO_OUT1_W1TC_V  0xFFFFFFFFU
#define GPIO_OUT1_W1TC_S  0

/** GPIO_OUT2_REG register
 *  GPIO output register
 */
#define GPIO_OUT2_REG (DR_REG_GPIO_BASE + 0x1c)
/** GPIO_OUT2_DATA_ORIG : R/W/SC/WTC; bitpos: [2:0]; default: 0;
 *  Configures the output value of GPIO64 ~ 66 output in simple GPIO output mode.
 *  0: Low level
 *  1: High level
 *  The value of bit64 ~ bit66 correspond to the output value of GPIO64 ~ GPIO66
 *  respectively. Bitxx ~ bitxx is invalid.
 */
#define GPIO_OUT2_DATA_ORIG    0x00000007U
#define GPIO_OUT2_DATA_ORIG_M  (GPIO_OUT2_DATA_ORIG_V << GPIO_OUT2_DATA_ORIG_S)
#define GPIO_OUT2_DATA_ORIG_V  0x00000007U
#define GPIO_OUT2_DATA_ORIG_S  0

/** GPIO_OUT2_W1TS_REG register
 *  GPIO output set register
 */
#define GPIO_OUT2_W1TS_REG (DR_REG_GPIO_BASE + 0x20)
/** GPIO_OUT2_W1TS : WT; bitpos: [2:0]; default: 0;
 *  Configures whether or not to set the output register GPIO_OUT2_REG of GPIO64 ~
 *  GPIO66.
 *  0: Not set
 *  1: The corresponding bit in GPIO_OUT2_REG will be set to 1
 *  Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to set GPIO_OUT2_REG.
 */
#define GPIO_OUT2_W1TS    0x00000007U
#define GPIO_OUT2_W1TS_M  (GPIO_OUT2_W1TS_V << GPIO_OUT2_W1TS_S)
#define GPIO_OUT2_W1TS_V  0x00000007U
#define GPIO_OUT2_W1TS_S  0

/** GPIO_OUT2_W1TC_REG register
 *  GPIO output clear register
 */
#define GPIO_OUT2_W1TC_REG (DR_REG_GPIO_BASE + 0x24)
/** GPIO_OUT2_W1TC : WT; bitpos: [2:0]; default: 0;
 *  Configures whether or not to clear the output register GPIO_OUT2_REG of GPIO64 ~
 *  GPIO66 output.
 *  0: Not clear
 *  1: The corresponding bit in GPIO_OUT2_REG will be cleared.
 *  Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to clear GPIO_OUT2_REG.
 */
#define GPIO_OUT2_W1TC    0x00000007U
#define GPIO_OUT2_W1TC_M  (GPIO_OUT2_W1TC_V << GPIO_OUT2_W1TC_S)
#define GPIO_OUT2_W1TC_V  0x00000007U
#define GPIO_OUT2_W1TC_S  0

/** GPIO_ENABLE_REG register
 *  GPIO output enable register
 */
#define GPIO_ENABLE_REG (DR_REG_GPIO_BASE + 0x34)
/** GPIO_ENABLE_DATA : R/W/WTC; bitpos: [31:0]; default: 0;
 *  Configures whether or not to enable the output of GPIO0 ~ GPIO31.
 *  0: Not enable
 *  1: Enable
 *  Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
 */
#define GPIO_ENABLE_DATA    0xFFFFFFFFU
#define GPIO_ENABLE_DATA_M  (GPIO_ENABLE_DATA_V << GPIO_ENABLE_DATA_S)
#define GPIO_ENABLE_DATA_V  0xFFFFFFFFU
#define GPIO_ENABLE_DATA_S  0

/** GPIO_ENABLE_W1TS_REG register
 *  GPIO output enable set register
 */
#define GPIO_ENABLE_W1TS_REG (DR_REG_GPIO_BASE + 0x38)
/** GPIO_ENABLE_W1TS : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to set the output enable register GPIO_ENABLE_REG of
 *  GPIO0 ~ GPIO31.
 *  0: Not set
 *  1: The corresponding bit in GPIO_ENABLE_REG will be set to 1
 *  Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to set GPIO_ENABLE_REG.
 */
#define GPIO_ENABLE_W1TS    0xFFFFFFFFU
#define GPIO_ENABLE_W1TS_M  (GPIO_ENABLE_W1TS_V << GPIO_ENABLE_W1TS_S)
#define GPIO_ENABLE_W1TS_V  0xFFFFFFFFU
#define GPIO_ENABLE_W1TS_S  0

/** GPIO_ENABLE_W1TC_REG register
 *  GPIO output enable clear register
 */
#define GPIO_ENABLE_W1TC_REG (DR_REG_GPIO_BASE + 0x3c)
/** GPIO_ENABLE_W1TC : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to clear the output enable register GPIO_ENABLE_REG of
 *  GPIO0 ~ GPIO31.
 *  0: Not clear
 *  1: The corresponding bit in GPIO_ENABLE_REG will be cleared
 *  Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to clear GPIO_ENABLE_REG.
 */
#define GPIO_ENABLE_W1TC    0xFFFFFFFFU
#define GPIO_ENABLE_W1TC_M  (GPIO_ENABLE_W1TC_V << GPIO_ENABLE_W1TC_S)
#define GPIO_ENABLE_W1TC_V  0xFFFFFFFFU
#define GPIO_ENABLE_W1TC_S  0

/** GPIO_ENABLE1_REG register
 *  GPIO output enable register
 */
#define GPIO_ENABLE1_REG (DR_REG_GPIO_BASE + 0x40)
/** GPIO_ENABLE1_DATA : R/W/WTC; bitpos: [31:0]; default: 0;
 *  Configures whether or not to enable the output of GPIO32 ~ GPIO63.
 *  0: Not enable
 *  1: Enable
 *  Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
 */
#define GPIO_ENABLE1_DATA    0xFFFFFFFFU
#define GPIO_ENABLE1_DATA_M  (GPIO_ENABLE1_DATA_V << GPIO_ENABLE1_DATA_S)
#define GPIO_ENABLE1_DATA_V  0xFFFFFFFFU
#define GPIO_ENABLE1_DATA_S  0

