espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_reg.h
/** GPIO_ENABLE1_W1TS_REG register
 *  GPIO output enable set register
 */
#define GPIO_ENABLE1_W1TS_REG (DR_REG_GPIO_BASE + 0x44)
/** GPIO_ENABLE1_W1TS : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to set the output enable register GPIO_ENABLE1_REG of
 *  GPIO32 ~ GPIO63.
 *  0: Not set
 *  1: The corresponding bit in GPIO_ENABLE1_REG will be set to 1
 *  Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to set GPIO_ENABLE1_REG.
 */
#define GPIO_ENABLE1_W1TS    0xFFFFFFFFU
#define GPIO_ENABLE1_W1TS_M  (GPIO_ENABLE1_W1TS_V << GPIO_ENABLE1_W1TS_S)
#define GPIO_ENABLE1_W1TS_V  0xFFFFFFFFU
#define GPIO_ENABLE1_W1TS_S  0

/** GPIO_ENABLE1_W1TC_REG register
 *  GPIO output enable clear register
 */
#define GPIO_ENABLE1_W1TC_REG (DR_REG_GPIO_BASE + 0x48)
/** GPIO_ENABLE1_W1TC : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to clear the output enable register GPIO_ENABLE1_REG of
 *  GPIO32 ~ GPIO63.
 *  0: Not clear
 *  1: The corresponding bit in GPIO_ENABLE1_REG will be cleared
 *  Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to clear GPIO_ENABLE1_REG.
 */
#define GPIO_ENABLE1_W1TC    0xFFFFFFFFU
#define GPIO_ENABLE1_W1TC_M  (GPIO_ENABLE1_W1TC_V << GPIO_ENABLE1_W1TC_S)
#define GPIO_ENABLE1_W1TC_V  0xFFFFFFFFU
#define GPIO_ENABLE1_W1TC_S  0

/** GPIO_ENABLE2_REG register
 *  GPIO output enable register
 */
#define GPIO_ENABLE2_REG (DR_REG_GPIO_BASE + 0x4c)
/** GPIO_ENABLE2_DATA : R/W/WTC; bitpos: [2:0]; default: 0;
 *  Configures whether or not to enable the output of GPIO64 ~ GPIO66.
 *  0: Not enable
 *  1: Enable
 *  Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
 */
#define GPIO_ENABLE2_DATA    0x00000007U
#define GPIO_ENABLE2_DATA_M  (GPIO_ENABLE2_DATA_V << GPIO_ENABLE2_DATA_S)
#define GPIO_ENABLE2_DATA_V  0x00000007U
#define GPIO_ENABLE2_DATA_S  0

/** GPIO_ENABLE2_W1TS_REG register
 *  GPIO output enable set register
 */
#define GPIO_ENABLE2_W1TS_REG (DR_REG_GPIO_BASE + 0x50)
/** GPIO_ENABLE2_W1TS : WT; bitpos: [2:0]; default: 0;
 *  Configures whether or not to set the output enable register GPIO_ENABLE2_REG of
 *  GPIO64 ~ GPIO66.
 *  0: Not set
 *  1: The corresponding bit in GPIO_ENABLE2_REG will be set to 1
 *  Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to set GPIO_ENABLE2_REG.
 */
#define GPIO_ENABLE2_W1TS    0x00000007U
#define GPIO_ENABLE2_W1TS_M  (GPIO_ENABLE2_W1TS_V << GPIO_ENABLE2_W1TS_S)
#define GPIO_ENABLE2_W1TS_V  0x00000007U
#define GPIO_ENABLE2_W1TS_S  0

/** GPIO_ENABLE2_W1TC_REG register
 *  GPIO output enable clear register
 */
#define GPIO_ENABLE2_W1TC_REG (DR_REG_GPIO_BASE + 0x54)
/** GPIO_ENABLE2_W1TC : WT; bitpos: [2:0]; default: 0;
 *  Configures whether or not to clear the output enable register GPIO_ENABLE2_REG of
 *  GPIO64 ~ GPIO66.
 *  0: Not clear
 *  1: The corresponding bit in GPIO_ENABLE2_REG will be cleared
 *  Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to clear GPIO_ENABLE2_REG.
 */
#define GPIO_ENABLE2_W1TC    0x00000007U
#define GPIO_ENABLE2_W1TC_M  (GPIO_ENABLE2_W1TC_V << GPIO_ENABLE2_W1TC_S)
#define GPIO_ENABLE2_W1TC_V  0x00000007U
#define GPIO_ENABLE2_W1TC_S  0

/** GPIO_IN_REG register
 *  GPIO input register
 */
#define GPIO_IN_REG (DR_REG_GPIO_BASE + 0x64)
/** GPIO_IN_DATA_NEXT : RO; bitpos: [31:0]; default: 0;
 *  Represents the input value of GPIO0 ~ GPIO31. Each bit represents a pin input value:
 *  0: Low level
 *  1: High level
 *  Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
 */
#define GPIO_IN_DATA_NEXT    0xFFFFFFFFU
#define GPIO_IN_DATA_NEXT_M  (GPIO_IN_DATA_NEXT_V << GPIO_IN_DATA_NEXT_S)
#define GPIO_IN_DATA_NEXT_V  0xFFFFFFFFU
#define GPIO_IN_DATA_NEXT_S  0

/** GPIO_IN1_REG register
 *  GPIO input register
 */
#define GPIO_IN1_REG (DR_REG_GPIO_BASE + 0x68)
/** GPIO_IN1_DATA_NEXT : RO; bitpos: [31:0]; default: 0;
 *  Represents the input value of GPIO32 ~ GPIO63. Each bit represents a pin input
 *  value:
 *  0: Low level
 *  1: High level
 *  Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
 */
#define GPIO_IN1_DATA_NEXT    0xFFFFFFFFU
#define GPIO_IN1_DATA_NEXT_M  (GPIO_IN1_DATA_NEXT_V << GPIO_IN1_DATA_NEXT_S)
#define GPIO_IN1_DATA_NEXT_V  0xFFFFFFFFU
#define GPIO_IN1_DATA_NEXT_S  0

/** GPIO_IN2_REG register
 *  GPIO input register
 */
#define GPIO_IN2_REG (DR_REG_GPIO_BASE + 0x6c)
/** GPIO_IN2_DATA_NEXT : RO; bitpos: [2:0]; default: 0;
 *  Represents the input value of GPIO64 ~ GPIO66. Each bit represents a pin input
 *  value:
 *  0: Low level
 *  1: High level
 *  Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
 */
#define GPIO_IN2_DATA_NEXT    0x00000007U
#define GPIO_IN2_DATA_NEXT_M  (GPIO_IN2_DATA_NEXT_V << GPIO_IN2_DATA_NEXT_S)
#define GPIO_IN2_DATA_NEXT_V  0x00000007U
#define GPIO_IN2_DATA_NEXT_S  0

/** GPIO_STATUS_REG register
 *  GPIO interrupt status register
 */
#define GPIO_STATUS_REG (DR_REG_GPIO_BASE + 0x74)
/** GPIO_STATUS_INTERRUPT : R/W/WTC; bitpos: [31:0]; default: 0;
 *  The interrupt status of GPIO0 ~ GPIO31, can be configured by the software.
 *
 *  - Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
 *  - Each bit represents the status of its corresponding GPIO:
 *
 *  - 0: Represents the GPIO does not generate the interrupt configured by
 *  GPIO_PIN$n_INT_TYPE, or this bit is configured to 0 by the software.
 *  - 1: Represents the GPIO generates the interrupt configured by GPIO_PIN$n_INT_TYPE,
 *  or this bit is configured to 1 by the software.
 *
 */
#define GPIO_STATUS_INTERRUPT    0xFFFFFFFFU
#define GPIO_STATUS_INTERRUPT_M  (GPIO_STATUS_INTERRUPT_V << GPIO_STATUS_INTERRUPT_S)
#define GPIO_STATUS_INTERRUPT_V  0xFFFFFFFFU
#define GPIO_STATUS_INTERRUPT_S  0

/** GPIO_STATUS_W1TS_REG register
 *  GPIO interrupt status set register
 */
#define GPIO_STATUS_W1TS_REG (DR_REG_GPIO_BASE + 0x78)
/** GPIO_STATUS_W1TS : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to set the interrupt status register
 *  GPIO_STATUS_INTERRUPT of GPIO0 ~ GPIO31.
 *
 *  - Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
 *  - If the value 1 is written to a bit here, the corresponding bit in
 *  GPIO_STATUS_INTERRUPT will be set to 1. \item Recommended operation: use this
 *  register to set GPIO_STATUS_INTERRUPT.
 */
#define GPIO_STATUS_W1TS    0xFFFFFFFFU
#define GPIO_STATUS_W1TS_M  (GPIO_STATUS_W1TS_V << GPIO_STATUS_W1TS_S)
#define GPIO_STATUS_W1TS_V  0xFFFFFFFFU
#define GPIO_STATUS_W1TS_S  0

/** GPIO_STATUS_W1TC_REG register
 *  GPIO interrupt status clear register
 */
#define GPIO_STATUS_W1TC_REG (DR_REG_GPIO_BASE + 0x7c)
/** GPIO_STATUS_W1TC : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to clear the interrupt status register
 *  GPIO_STATUS_INTERRUPT of GPIO0 ~ GPIO31.
 *
 *  - Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid.
 *  - If the value 1 is written to a bit here, the corresponding bit in
 *  GPIO_STATUS_INTERRUPT will be cleared. \item Recommended operation: use this
 *  register to clear GPIO_STATUS_INTERRUPT.
 */
#define GPIO_STATUS_W1TC    0xFFFFFFFFU
#define GPIO_STATUS_W1TC_M  (GPIO_STATUS_W1TC_V << GPIO_STATUS_W1TC_S)
#define GPIO_STATUS_W1TC_V  0xFFFFFFFFU
#define GPIO_STATUS_W1TC_S  0

