espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_reg.h
/** GPIO_STATUS1_REG register
 *  GPIO interrupt status register
 */
#define GPIO_STATUS1_REG (DR_REG_GPIO_BASE + 0x80)
/** GPIO_STATUS1_INTERRUPT : R/W/WTC; bitpos: [31:0]; default: 0;
 *  The interrupt status of GPIO32 ~ GPIO63, can be configured by the software.
 *
 *  - Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
 *  - Each bit represents the status of its corresponding GPIO:
 *
 *  - 0: Represents the GPIO does not generate the interrupt configured by
 *  GPIO_PIN$n_INT_TYPE, or this bit is configured to 0 by the software.
 *  - 1: Represents the GPIO generates the interrupt configured by GPIO_PIN$n_INT_TYPE,
 *  or this bit is configured to 1 by the software.
 *
 */
#define GPIO_STATUS1_INTERRUPT    0xFFFFFFFFU
#define GPIO_STATUS1_INTERRUPT_M  (GPIO_STATUS1_INTERRUPT_V << GPIO_STATUS1_INTERRUPT_S)
#define GPIO_STATUS1_INTERRUPT_V  0xFFFFFFFFU
#define GPIO_STATUS1_INTERRUPT_S  0

/** GPIO_STATUS1_W1TS_REG register
 *  GPIO interrupt status set register
 */
#define GPIO_STATUS1_W1TS_REG (DR_REG_GPIO_BASE + 0x84)
/** GPIO_STATUS1_W1TS : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to set the interrupt status register
 *  GPIO_STATUS1_INTERRUPT of GPIO32 ~ GPIO63.
 *
 *  - Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
 *  - If the value 1 is written to a bit here, the corresponding bit in
 *  GPIO_STATUS1_INTERRUPT will be set to 1. \item Recommended operation: use this
 *  register to set GPIO_STATUS1_INTERRUPT.
 */
#define GPIO_STATUS1_W1TS    0xFFFFFFFFU
#define GPIO_STATUS1_W1TS_M  (GPIO_STATUS1_W1TS_V << GPIO_STATUS1_W1TS_S)
#define GPIO_STATUS1_W1TS_V  0xFFFFFFFFU
#define GPIO_STATUS1_W1TS_S  0

/** GPIO_STATUS1_W1TC_REG register
 *  GPIO interrupt status clear register
 */
#define GPIO_STATUS1_W1TC_REG (DR_REG_GPIO_BASE + 0x88)
/** GPIO_STATUS1_W1TC : WT; bitpos: [31:0]; default: 0;
 *  Configures whether or not to clear the interrupt status register
 *  GPIO_STATUS1_INTERRUPT of GPIO32 ~ GPIO63.
 *
 *  - Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid.
 *  - If the value 1 is written to a bit here, the corresponding bit in
 *  GPIO_STATUS1_INTERRUPT will be cleared. \item Recommended operation: use this
 *  register to clear GPIO_STATUS1_INTERRUPT.
 */
#define GPIO_STATUS1_W1TC    0xFFFFFFFFU
#define GPIO_STATUS1_W1TC_M  (GPIO_STATUS1_W1TC_V << GPIO_STATUS1_W1TC_S)
#define GPIO_STATUS1_W1TC_V  0xFFFFFFFFU
#define GPIO_STATUS1_W1TC_S  0

/** GPIO_STATUS2_REG register
 *  GPIO interrupt status register
 */
#define GPIO_STATUS2_REG (DR_REG_GPIO_BASE + 0x8c)
/** GPIO_STATUS2_INTERRUPT : R/W/WTC; bitpos: [2:0]; default: 0;
 *  The interrupt status of GPIO64 ~ GPIO66, can be configured by the software.
 *
 *  - Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
 *  - Each bit represents the status of its corresponding GPIO:
 *
 *  - 0: Represents the GPIO does not generate the interrupt configured by
 *  GPIO_PIN$n_INT_TYPE, or this bit is configured to 0 by the software.
 *  - 1: Represents the GPIO generates the interrupt configured by GPIO_PIN$n_INT_TYPE,
 *  or this bit is configured to 1 by the software.
 *
 */
#define GPIO_STATUS2_INTERRUPT    0x00000007U
#define GPIO_STATUS2_INTERRUPT_M  (GPIO_STATUS2_INTERRUPT_V << GPIO_STATUS2_INTERRUPT_S)
#define GPIO_STATUS2_INTERRUPT_V  0x00000007U
#define GPIO_STATUS2_INTERRUPT_S  0

/** GPIO_STATUS2_W1TS_REG register
 *  GPIO interrupt status set register
 */
#define GPIO_STATUS2_W1TS_REG (DR_REG_GPIO_BASE + 0x90)
/** GPIO_STATUS2_W1TS : WT; bitpos: [2:0]; default: 0;
 *  Configures whether or not to set the interrupt status register
 *  GPIO_STATUS2_INTERRUPT of GPIO64 ~ GPIO66.
 *
 *  - Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
 *  - If the value 1 is written to a bit here, the corresponding bit in
 *  GPIO_STATUS2_INTERRUPT will be set to 1. \item Recommended operation: use this
 *  register to set GPIO_STATUS2_INTERRUPT.
 */
#define GPIO_STATUS2_W1TS    0x00000007U
#define GPIO_STATUS2_W1TS_M  (GPIO_STATUS2_W1TS_V << GPIO_STATUS2_W1TS_S)
#define GPIO_STATUS2_W1TS_V  0x00000007U
#define GPIO_STATUS2_W1TS_S  0

/** GPIO_STATUS2_W1TC_REG register
 *  GPIO interrupt status clear register
 */
#define GPIO_STATUS2_W1TC_REG (DR_REG_GPIO_BASE + 0x94)
/** GPIO_STATUS2_W1TC : WT; bitpos: [2:0]; default: 0;
 *  Configures whether or not to clear the interrupt status register
 *  GPIO_STATUS2_INTERRUPT of GPIO64 ~ GPIO66.
 *
 *  - Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid.
 *  - If the value 1 is written to a bit here, the corresponding bit in
 *  GPIO_STATUS2_INTERRUPT will be cleared. \item Recommended operation: use this
 *  register to clear GPIO_STATUS2_INTERRUPT.
 */
#define GPIO_STATUS2_W1TC    0x00000007U
#define GPIO_STATUS2_W1TC_M  (GPIO_STATUS2_W1TC_V << GPIO_STATUS2_W1TC_S)
#define GPIO_STATUS2_W1TC_V  0x00000007U
#define GPIO_STATUS2_W1TC_S  0

/** GPIO_INT_0_REG register
 *  GPIO_INT_0 interrupt status register
 */
#define GPIO_INT_0_REG (DR_REG_GPIO_BASE + 0xa4)
/** GPIO_INT_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the GPIO_INT_0 interrupt status of GPIO0 ~ GPIO31. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_0 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_0 interrupt is enabled.
 *  Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_0    0xFFFFFFFFU
#define GPIO_INT_0_M  (GPIO_INT_0_V << GPIO_INT_0_S)
#define GPIO_INT_0_V  0xFFFFFFFFU
#define GPIO_INT_0_S  0

/** GPIO_INT_1_REG register
 *  GPIO_INT_1 interrupt status register
 */
#define GPIO_INT_1_REG (DR_REG_GPIO_BASE + 0xa8)
/** GPIO_INT_1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the GPIO_INT_1 interrupt status of GPIO0 ~ GPIO31. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_1 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_1 interrupt is enabled.
 *  Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_1    0xFFFFFFFFU
#define GPIO_INT_1_M  (GPIO_INT_1_V << GPIO_INT_1_S)
#define GPIO_INT_1_V  0xFFFFFFFFU
#define GPIO_INT_1_S  0

/** GPIO_INT_2_REG register
 *  GPIO_INT_2 interrupt status register
 */
#define GPIO_INT_2_REG (DR_REG_GPIO_BASE + 0xac)
/** GPIO_INT_2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the GPIO_INT_2 interrupt status of GPIO0 ~ GPIO31. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_2 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_2 interrupt is enabled.
 *  Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_2    0xFFFFFFFFU
#define GPIO_INT_2_M  (GPIO_INT_2_V << GPIO_INT_2_S)
#define GPIO_INT_2_V  0xFFFFFFFFU
#define GPIO_INT_2_S  0

