espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_reg.h
/** GPIO_INT_3_REG register
 *  GPIO_INT_3 interrupt status register
 */
#define GPIO_INT_3_REG (DR_REG_GPIO_BASE + 0xb0)
/** GPIO_INT_3 : RO; bitpos: [31:0]; default: 0;
 *  Represents the GPIO_INT_3 interrupt status of GPIO0 ~ GPIO31. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_3 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_3 interrupt is enabled.
 *  Bit0 ~ bit31 are corresponding to GPIO0 ~ GPIO31. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_3    0xFFFFFFFFU
#define GPIO_INT_3_M  (GPIO_INT_3_V << GPIO_INT_3_S)
#define GPIO_INT_3_V  0xFFFFFFFFU
#define GPIO_INT_3_S  0

/** GPIO_INT_01_REG register
 *  GPIO_INT_0 interrupt status register
 */
#define GPIO_INT_01_REG (DR_REG_GPIO_BASE + 0xb4)
/** GPIO_INT_01 : RO; bitpos: [31:0]; default: 0;
 *  Represents the GPIO_INT_0 interrupt status of GPIO32 ~ GPIO63. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_0 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_0 interrupt is enabled.
 *  Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS1_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_01    0xFFFFFFFFU
#define GPIO_INT_01_M  (GPIO_INT_01_V << GPIO_INT_01_S)
#define GPIO_INT_01_V  0xFFFFFFFFU
#define GPIO_INT_01_S  0

/** GPIO_INT_11_REG register
 *  GPIO_INT_1 interrupt status register
 */
#define GPIO_INT_11_REG (DR_REG_GPIO_BASE + 0xb8)
/** GPIO_INT_11 : RO; bitpos: [31:0]; default: 0;
 *  Represents the GPIO_INT_1 interrupt status of GPIO32 ~ GPIO63. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_1 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_1 interrupt is enabled.
 *  Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS1_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_11    0xFFFFFFFFU
#define GPIO_INT_11_M  (GPIO_INT_11_V << GPIO_INT_11_S)
#define GPIO_INT_11_V  0xFFFFFFFFU
#define GPIO_INT_11_S  0

/** GPIO_INT_21_REG register
 *  GPIO_INT_2 interrupt status register
 */
#define GPIO_INT_21_REG (DR_REG_GPIO_BASE + 0xbc)
/** GPIO_INT_21 : RO; bitpos: [31:0]; default: 0;
 *  Represents the GPIO_INT_2 interrupt status of GPIO32 ~ GPIO63. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_2 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_2 interrupt is enabled.
 *  Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS1_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_21    0xFFFFFFFFU
#define GPIO_INT_21_M  (GPIO_INT_21_V << GPIO_INT_21_S)
#define GPIO_INT_21_V  0xFFFFFFFFU
#define GPIO_INT_21_S  0

/** GPIO_INT_31_REG register
 *  GPIO_INT_3 interrupt status register
 */
#define GPIO_INT_31_REG (DR_REG_GPIO_BASE + 0xc0)
/** GPIO_INT_31 : RO; bitpos: [31:0]; default: 0;
 *  Represents the GPIO_INT_3 interrupt status of GPIO32 ~ GPIO63. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_3 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_3 interrupt is enabled.
 *  Bit32 ~ bit63 are corresponding to GPIO32 ~ GPIO63. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS1_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_31    0xFFFFFFFFU
#define GPIO_INT_31_M  (GPIO_INT_31_V << GPIO_INT_31_S)
#define GPIO_INT_31_V  0xFFFFFFFFU
#define GPIO_INT_31_S  0

/** GPIO_INT_02_REG register
 *  GPIO_INT_0 interrupt status register
 */
#define GPIO_INT_02_REG (DR_REG_GPIO_BASE + 0xc4)
/** GPIO_INT_02 : RO; bitpos: [2:0]; default: 0;
 *  Represents the GPIO_INT_0 interrupt status of GPIO64 ~ GPIO66. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_0 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_0 interrupt is enabled.
 *  Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS2_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_02    0x00000007U
#define GPIO_INT_02_M  (GPIO_INT_02_V << GPIO_INT_02_S)
#define GPIO_INT_02_V  0x00000007U
#define GPIO_INT_02_S  0

/** GPIO_INT_12_REG register
 *  GPIO_INT_1 interrupt status register
 */
#define GPIO_INT_12_REG (DR_REG_GPIO_BASE + 0xc8)
/** GPIO_INT_12 : RO; bitpos: [2:0]; default: 0;
 *  Represents the GPIO_INT_1 interrupt status of GPIO64 ~ GPIO66. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_1 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_1 interrupt is enabled.
 *  Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS2_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_12    0x00000007U
#define GPIO_INT_12_M  (GPIO_INT_12_V << GPIO_INT_12_S)
#define GPIO_INT_12_V  0x00000007U
#define GPIO_INT_12_S  0

/** GPIO_INT_22_REG register
 *  GPIO_INT_2 interrupt status register
 */
#define GPIO_INT_22_REG (DR_REG_GPIO_BASE + 0xcc)
/** GPIO_INT_22 : RO; bitpos: [2:0]; default: 0;
 *  Represents the GPIO_INT_2 interrupt status of GPIO64 ~ GPIO66. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_2 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_2 interrupt is enabled.
 *  Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS2_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_22    0x00000007U
#define GPIO_INT_22_M  (GPIO_INT_22_V << GPIO_INT_22_S)
#define GPIO_INT_22_V  0x00000007U
#define GPIO_INT_22_S  0

/** GPIO_INT_32_REG register
 *  GPIO_INT_3 interrupt status register
 */
#define GPIO_INT_32_REG (DR_REG_GPIO_BASE + 0xd0)
/** GPIO_INT_32 : RO; bitpos: [2:0]; default: 0;
 *  Represents the GPIO_INT_3 interrupt status of GPIO64 ~ GPIO66. Each bit
 *  represents:(need update in different project)
 *  0: Represents GPIO_INT_3 interrupt is not enabled, or the GPIO does not generate
 *  the interrupt configured by GPIO_PIN$n_INT_TYPE.
 *  1: Represents the GPIO generates an interrupt configured by GPIO_PIN$n_INT_TYPE
 *  after the GPIO_INT_3 interrupt is enabled.
 *  Bit64 ~ bit66 are corresponding to GPIO64 ~ GPIO66. Bitxx ~ bitxx is invalid. This
 *  interrupt status is corresponding to the bit in GPIO_STATUS2_REG when assert (high)
 *  enable signal (bit13 of GPIO_PIN$n_REG).
 */
#define GPIO_INT_32    0x00000007U
#define GPIO_INT_32_M  (GPIO_INT_32_V << GPIO_INT_32_S)
#define GPIO_INT_32_V  0x00000007U
#define GPIO_INT_32_S  0

