espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_reg.h
/** GPIO_PIN58_REG register
 *  GPIO58 configuration register
 */
#define GPIO_PIN58_REG (DR_REG_GPIO_BASE + 0x1dc)
/** GPIO_PIN58_SYNC2_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  Configures whether or not to synchronize GPIO input data on either edge of IO MUX
 *  operating clock for the second-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define GPIO_PIN58_SYNC2_BYPASS    0x00000003U
#define GPIO_PIN58_SYNC2_BYPASS_M  (GPIO_PIN58_SYNC2_BYPASS_V << GPIO_PIN58_SYNC2_BYPASS_S)
#define GPIO_PIN58_SYNC2_BYPASS_V  0x00000003U
#define GPIO_PIN58_SYNC2_BYPASS_S  0
/** GPIO_PIN58_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  Configures to select pin drive mode.
 *  0: Normal output
 *  1: Open drain output
 */
#define GPIO_PIN58_PAD_DRIVER    (BIT(2))
#define GPIO_PIN58_PAD_DRIVER_M  (GPIO_PIN58_PAD_DRIVER_V << GPIO_PIN58_PAD_DRIVER_S)
#define GPIO_PIN58_PAD_DRIVER_V  0x00000001U
#define GPIO_PIN58_PAD_DRIVER_S  2
/** GPIO_PIN58_SYNC1_BYPASS : R/W; bitpos: [4:3]; default: 0;
 *  Configures whether or not to synchronize GPIO input data on either edge of IO MUX
 *  operating clock for the first-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define GPIO_PIN58_SYNC1_BYPASS    0x00000003U
#define GPIO_PIN58_SYNC1_BYPASS_M  (GPIO_PIN58_SYNC1_BYPASS_V << GPIO_PIN58_SYNC1_BYPASS_S)
#define GPIO_PIN58_SYNC1_BYPASS_V  0x00000003U
#define GPIO_PIN58_SYNC1_BYPASS_S  3
/** GPIO_PIN58_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  Configures GPIO interrupt type.
 *  0: GPIO interrupt disabled
 *  1: Rising edge trigger
 *  2: Falling edge trigger
 *  3: Any edge trigger
 *  4: Low level trigger
 *  5: High level trigger
 */
#define GPIO_PIN58_INT_TYPE    0x00000007U
#define GPIO_PIN58_INT_TYPE_M  (GPIO_PIN58_INT_TYPE_V << GPIO_PIN58_INT_TYPE_S)
#define GPIO_PIN58_INT_TYPE_V  0x00000007U
#define GPIO_PIN58_INT_TYPE_S  7
/** GPIO_PIN58_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  Configures whether or not to enable GPIO wake-up function.
 *  0: Disable
 *  1: Enable
 *  This function only wakes up the CPU from Light-sleep.
 */
#define GPIO_PIN58_WAKEUP_ENABLE    (BIT(10))
#define GPIO_PIN58_WAKEUP_ENABLE_M  (GPIO_PIN58_WAKEUP_ENABLE_V << GPIO_PIN58_WAKEUP_ENABLE_S)
#define GPIO_PIN58_WAKEUP_ENABLE_V  0x00000001U
#define GPIO_PIN58_WAKEUP_ENABLE_S  10
/** GPIO_PIN58_INT_ENA : R/W; bitpos: [17:13]; default: 0;
 *  Configures whether or not to enable gpio_int_0 or gpio_int_1 or gpio_int_2 or
 *  gpio_int_3(need update in different project).
 *
 *  - bit13: Configures whether or not to enable gpio_int_0(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit14: Configures whether or not to enable gpio_int_1(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit15: Configures whether or not to enable gpio_int_2(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit16: Configures whether or not to enable gpio_int_3(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit17: invalid
 */
#define GPIO_PIN58_INT_ENA    0x0000001FU
#define GPIO_PIN58_INT_ENA_M  (GPIO_PIN58_INT_ENA_V << GPIO_PIN58_INT_ENA_S)
#define GPIO_PIN58_INT_ENA_V  0x0000001FU
#define GPIO_PIN58_INT_ENA_S  13

/** GPIO_PIN59_REG register
 *  GPIO59 configuration register
 */
#define GPIO_PIN59_REG (DR_REG_GPIO_BASE + 0x1e0)
/** GPIO_PIN59_SYNC2_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  Configures whether or not to synchronize GPIO input data on either edge of IO MUX
 *  operating clock for the second-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define GPIO_PIN59_SYNC2_BYPASS    0x00000003U
#define GPIO_PIN59_SYNC2_BYPASS_M  (GPIO_PIN59_SYNC2_BYPASS_V << GPIO_PIN59_SYNC2_BYPASS_S)
#define GPIO_PIN59_SYNC2_BYPASS_V  0x00000003U
#define GPIO_PIN59_SYNC2_BYPASS_S  0
/** GPIO_PIN59_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  Configures to select pin drive mode.
 *  0: Normal output
 *  1: Open drain output
 */
#define GPIO_PIN59_PAD_DRIVER    (BIT(2))
#define GPIO_PIN59_PAD_DRIVER_M  (GPIO_PIN59_PAD_DRIVER_V << GPIO_PIN59_PAD_DRIVER_S)
#define GPIO_PIN59_PAD_DRIVER_V  0x00000001U
#define GPIO_PIN59_PAD_DRIVER_S  2
/** GPIO_PIN59_SYNC1_BYPASS : R/W; bitpos: [4:3]; default: 0;
 *  Configures whether or not to synchronize GPIO input data on either edge of IO MUX
 *  operating clock for the first-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define GPIO_PIN59_SYNC1_BYPASS    0x00000003U
#define GPIO_PIN59_SYNC1_BYPASS_M  (GPIO_PIN59_SYNC1_BYPASS_V << GPIO_PIN59_SYNC1_BYPASS_S)
#define GPIO_PIN59_SYNC1_BYPASS_V  0x00000003U
#define GPIO_PIN59_SYNC1_BYPASS_S  3
/** GPIO_PIN59_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  Configures GPIO interrupt type.
 *  0: GPIO interrupt disabled
 *  1: Rising edge trigger
 *  2: Falling edge trigger
 *  3: Any edge trigger
 *  4: Low level trigger
 *  5: High level trigger
 */
#define GPIO_PIN59_INT_TYPE    0x00000007U
#define GPIO_PIN59_INT_TYPE_M  (GPIO_PIN59_INT_TYPE_V << GPIO_PIN59_INT_TYPE_S)
#define GPIO_PIN59_INT_TYPE_V  0x00000007U
#define GPIO_PIN59_INT_TYPE_S  7
/** GPIO_PIN59_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  Configures whether or not to enable GPIO wake-up function.
 *  0: Disable
 *  1: Enable
 *  This function only wakes up the CPU from Light-sleep.
 */
#define GPIO_PIN59_WAKEUP_ENABLE    (BIT(10))
#define GPIO_PIN59_WAKEUP_ENABLE_M  (GPIO_PIN59_WAKEUP_ENABLE_V << GPIO_PIN59_WAKEUP_ENABLE_S)
#define GPIO_PIN59_WAKEUP_ENABLE_V  0x00000001U
#define GPIO_PIN59_WAKEUP_ENABLE_S  10
/** GPIO_PIN59_INT_ENA : R/W; bitpos: [17:13]; default: 0;
 *  Configures whether or not to enable gpio_int_0 or gpio_int_1 or gpio_int_2 or
 *  gpio_int_3(need update in different project).
 *
 *  - bit13: Configures whether or not to enable gpio_int_0(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit14: Configures whether or not to enable gpio_int_1(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit15: Configures whether or not to enable gpio_int_2(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit16: Configures whether or not to enable gpio_int_3(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit17: invalid
 */
#define GPIO_PIN59_INT_ENA    0x0000001FU
#define GPIO_PIN59_INT_ENA_M  (GPIO_PIN59_INT_ENA_V << GPIO_PIN59_INT_ENA_S)
#define GPIO_PIN59_INT_ENA_V  0x0000001FU
#define GPIO_PIN59_INT_ENA_S  13

/** GPIO_PIN60_REG register
 *  GPIO60 configuration register
 */
#define GPIO_PIN60_REG (DR_REG_GPIO_BASE + 0x1e4)
/** GPIO_PIN60_SYNC2_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  Configures whether or not to synchronize GPIO input data on either edge of IO MUX
 *  operating clock for the second-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define GPIO_PIN60_SYNC2_BYPASS    0x00000003U
#define GPIO_PIN60_SYNC2_BYPASS_M  (GPIO_PIN60_SYNC2_BYPASS_V << GPIO_PIN60_SYNC2_BYPASS_S)
#define GPIO_PIN60_SYNC2_BYPASS_V  0x00000003U
#define GPIO_PIN60_SYNC2_BYPASS_S  0
/** GPIO_PIN60_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  Configures to select pin drive mode.
 *  0: Normal output
 *  1: Open drain output
 */
#define GPIO_PIN60_PAD_DRIVER    (BIT(2))
#define GPIO_PIN60_PAD_DRIVER_M  (GPIO_PIN60_PAD_DRIVER_V << GPIO_PIN60_PAD_DRIVER_S)
#define GPIO_PIN60_PAD_DRIVER_V  0x00000001U
#define GPIO_PIN60_PAD_DRIVER_S  2
/** GPIO_PIN60_SYNC1_BYPASS : R/W; bitpos: [4:3]; default: 0;
 *  Configures whether or not to synchronize GPIO input data on either edge of IO MUX
 *  operating clock for the first-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define GPIO_PIN60_SYNC1_BYPASS    0x00000003U
#define GPIO_PIN60_SYNC1_BYPASS_M  (GPIO_PIN60_SYNC1_BYPASS_V << GPIO_PIN60_SYNC1_BYPASS_S)
#define GPIO_PIN60_SYNC1_BYPASS_V  0x00000003U
#define GPIO_PIN60_SYNC1_BYPASS_S  3
/** GPIO_PIN60_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  Configures GPIO interrupt type.
 *  0: GPIO interrupt disabled
 *  1: Rising edge trigger
 *  2: Falling edge trigger
 *  3: Any edge trigger
 *  4: Low level trigger
 *  5: High level trigger
 */
#define GPIO_PIN60_INT_TYPE    0x00000007U
#define GPIO_PIN60_INT_TYPE_M  (GPIO_PIN60_INT_TYPE_V << GPIO_PIN60_INT_TYPE_S)
#define GPIO_PIN60_INT_TYPE_V  0x00000007U
#define GPIO_PIN60_INT_TYPE_S  7
/** GPIO_PIN60_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  Configures whether or not to enable GPIO wake-up function.
 *  0: Disable
 *  1: Enable
 *  This function only wakes up the CPU from Light-sleep.
 */
#define GPIO_PIN60_WAKEUP_ENABLE    (BIT(10))
#define GPIO_PIN60_WAKEUP_ENABLE_M  (GPIO_PIN60_WAKEUP_ENABLE_V << GPIO_PIN60_WAKEUP_ENABLE_S)
#define GPIO_PIN60_WAKEUP_ENABLE_V  0x00000001U
#define GPIO_PIN60_WAKEUP_ENABLE_S  10
/** GPIO_PIN60_INT_ENA : R/W; bitpos: [17:13]; default: 0;
 *  Configures whether or not to enable gpio_int_0 or gpio_int_1 or gpio_int_2 or
 *  gpio_int_3(need update in different project).
 *
 *  - bit13: Configures whether or not to enable gpio_int_0(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit14: Configures whether or not to enable gpio_int_1(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit15: Configures whether or not to enable gpio_int_2(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit16: Configures whether or not to enable gpio_int_3(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit17: invalid
 */
#define GPIO_PIN60_INT_ENA    0x0000001FU
#define GPIO_PIN60_INT_ENA_M  (GPIO_PIN60_INT_ENA_V << GPIO_PIN60_INT_ENA_S)
#define GPIO_PIN60_INT_ENA_V  0x0000001FU
#define GPIO_PIN60_INT_ENA_S  13

/** GPIO_PIN61_REG register
 *  GPIO61 configuration register
 */
#define GPIO_PIN61_REG (DR_REG_GPIO_BASE + 0x1e8)
/** GPIO_PIN61_SYNC2_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  Configures whether or not to synchronize GPIO input data on either edge of IO MUX
 *  operating clock for the second-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define GPIO_PIN61_SYNC2_BYPASS    0x00000003U
#define GPIO_PIN61_SYNC2_BYPASS_M  (GPIO_PIN61_SYNC2_BYPASS_V << GPIO_PIN61_SYNC2_BYPASS_S)
#define GPIO_PIN61_SYNC2_BYPASS_V  0x00000003U
#define GPIO_PIN61_SYNC2_BYPASS_S  0
/** GPIO_PIN61_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  Configures to select pin drive mode.
 *  0: Normal output
 *  1: Open drain output
 */
#define GPIO_PIN61_PAD_DRIVER    (BIT(2))
#define GPIO_PIN61_PAD_DRIVER_M  (GPIO_PIN61_PAD_DRIVER_V << GPIO_PIN61_PAD_DRIVER_S)
#define GPIO_PIN61_PAD_DRIVER_V  0x00000001U
#define GPIO_PIN61_PAD_DRIVER_S  2
/** GPIO_PIN61_SYNC1_BYPASS : R/W; bitpos: [4:3]; default: 0;
 *  Configures whether or not to synchronize GPIO input data on either edge of IO MUX
 *  operating clock for the first-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define GPIO_PIN61_SYNC1_BYPASS    0x00000003U
#define GPIO_PIN61_SYNC1_BYPASS_M  (GPIO_PIN61_SYNC1_BYPASS_V << GPIO_PIN61_SYNC1_BYPASS_S)
#define GPIO_PIN61_SYNC1_BYPASS_V  0x00000003U
#define GPIO_PIN61_SYNC1_BYPASS_S  3
/** GPIO_PIN61_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  Configures GPIO interrupt type.
 *  0: GPIO interrupt disabled
 *  1: Rising edge trigger
 *  2: Falling edge trigger
 *  3: Any edge trigger
 *  4: Low level trigger
 *  5: High level trigger
 */
#define GPIO_PIN61_INT_TYPE    0x00000007U
#define GPIO_PIN61_INT_TYPE_M  (GPIO_PIN61_INT_TYPE_V << GPIO_PIN61_INT_TYPE_S)
#define GPIO_PIN61_INT_TYPE_V  0x00000007U
#define GPIO_PIN61_INT_TYPE_S  7
/** GPIO_PIN61_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  Configures whether or not to enable GPIO wake-up function.
 *  0: Disable
 *  1: Enable
 *  This function only wakes up the CPU from Light-sleep.
 */
#define GPIO_PIN61_WAKEUP_ENABLE    (BIT(10))
#define GPIO_PIN61_WAKEUP_ENABLE_M  (GPIO_PIN61_WAKEUP_ENABLE_V << GPIO_PIN61_WAKEUP_ENABLE_S)
#define GPIO_PIN61_WAKEUP_ENABLE_V  0x00000001U
#define GPIO_PIN61_WAKEUP_ENABLE_S  10
/** GPIO_PIN61_INT_ENA : R/W; bitpos: [17:13]; default: 0;
 *  Configures whether or not to enable gpio_int_0 or gpio_int_1 or gpio_int_2 or
 *  gpio_int_3(need update in different project).
 *
 *  - bit13: Configures whether or not to enable gpio_int_0(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit14: Configures whether or not to enable gpio_int_1(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit15: Configures whether or not to enable gpio_int_2(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit16: Configures whether or not to enable gpio_int_3(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit17: invalid
 */
#define GPIO_PIN61_INT_ENA    0x0000001FU
#define GPIO_PIN61_INT_ENA_M  (GPIO_PIN61_INT_ENA_V << GPIO_PIN61_INT_ENA_S)
#define GPIO_PIN61_INT_ENA_V  0x0000001FU
#define GPIO_PIN61_INT_ENA_S  13

/** GPIO_PIN62_REG register
 *  GPIO62 configuration register
 */
#define GPIO_PIN62_REG (DR_REG_GPIO_BASE + 0x1ec)
/** GPIO_PIN62_SYNC2_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  Configures whether or not to synchronize GPIO input data on either edge of IO MUX
 *  operating clock for the second-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define GPIO_PIN62_SYNC2_BYPASS    0x00000003U
#define GPIO_PIN62_SYNC2_BYPASS_M  (GPIO_PIN62_SYNC2_BYPASS_V << GPIO_PIN62_SYNC2_BYPASS_S)
#define GPIO_PIN62_SYNC2_BYPASS_V  0x00000003U
#define GPIO_PIN62_SYNC2_BYPASS_S  0
/** GPIO_PIN62_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  Configures to select pin drive mode.
 *  0: Normal output
 *  1: Open drain output
 */
#define GPIO_PIN62_PAD_DRIVER    (BIT(2))
#define GPIO_PIN62_PAD_DRIVER_M  (GPIO_PIN62_PAD_DRIVER_V << GPIO_PIN62_PAD_DRIVER_S)
#define GPIO_PIN62_PAD_DRIVER_V  0x00000001U
#define GPIO_PIN62_PAD_DRIVER_S  2
/** GPIO_PIN62_SYNC1_BYPASS : R/W; bitpos: [4:3]; default: 0;
 *  Configures whether or not to synchronize GPIO input data on either edge of IO MUX
 *  operating clock for the first-level synchronization.
 *  0: Not synchronize
 *  1: Synchronize on falling edge
 *  2: Synchronize on rising edge
 *  3: Synchronize on rising edge
 */
#define GPIO_PIN62_SYNC1_BYPASS    0x00000003U
#define GPIO_PIN62_SYNC1_BYPASS_M  (GPIO_PIN62_SYNC1_BYPASS_V << GPIO_PIN62_SYNC1_BYPASS_S)
#define GPIO_PIN62_SYNC1_BYPASS_V  0x00000003U
#define GPIO_PIN62_SYNC1_BYPASS_S  3
/** GPIO_PIN62_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  Configures GPIO interrupt type.
 *  0: GPIO interrupt disabled
 *  1: Rising edge trigger
 *  2: Falling edge trigger
 *  3: Any edge trigger
 *  4: Low level trigger
 *  5: High level trigger
 */
#define GPIO_PIN62_INT_TYPE    0x00000007U
#define GPIO_PIN62_INT_TYPE_M  (GPIO_PIN62_INT_TYPE_V << GPIO_PIN62_INT_TYPE_S)
#define GPIO_PIN62_INT_TYPE_V  0x00000007U
#define GPIO_PIN62_INT_TYPE_S  7
/** GPIO_PIN62_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  Configures whether or not to enable GPIO wake-up function.
 *  0: Disable
 *  1: Enable
 *  This function only wakes up the CPU from Light-sleep.
 */
#define GPIO_PIN62_WAKEUP_ENABLE    (BIT(10))
#define GPIO_PIN62_WAKEUP_ENABLE_M  (GPIO_PIN62_WAKEUP_ENABLE_V << GPIO_PIN62_WAKEUP_ENABLE_S)
#define GPIO_PIN62_WAKEUP_ENABLE_V  0x00000001U
#define GPIO_PIN62_WAKEUP_ENABLE_S  10
/** GPIO_PIN62_INT_ENA : R/W; bitpos: [17:13]; default: 0;
 *  Configures whether or not to enable gpio_int_0 or gpio_int_1 or gpio_int_2 or
 *  gpio_int_3(need update in different project).
 *
 *  - bit13: Configures whether or not to enable gpio_int_0(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit14: Configures whether or not to enable gpio_int_1(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit15: Configures whether or not to enable gpio_int_2(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit16: Configures whether or not to enable gpio_int_3(need update in different
 *  project):
 *  0: Disable
 *  1: Enable
 *  - bit17: invalid
 */
#define GPIO_PIN62_INT_ENA    0x0000001FU
#define GPIO_PIN62_INT_ENA_M  (GPIO_PIN62_INT_ENA_V << GPIO_PIN62_INT_ENA_S)
#define GPIO_PIN62_INT_ENA_V  0x0000001FU
#define GPIO_PIN62_INT_ENA_S  13

/** GPIO_FUNC0_IN_SEL_CFG_REG register
 *  Configuration register for input signal 0
 */
#define GPIO_FUNC0_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x2f4)
/** GPIO_FUNC0_IN_SEL : R/W; bitpos: [7:0]; default: 128;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 0.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC0_IN_SEL    0x000000FFU
#define GPIO_FUNC0_IN_SEL_M  (GPIO_FUNC0_IN_SEL_V << GPIO_FUNC0_IN_SEL_S)
#define GPIO_FUNC0_IN_SEL_V  0x000000FFU
#define GPIO_FUNC0_IN_SEL_S  0
/** GPIO_FUNC0_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC0_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC0_IN_INV_SEL_M  (GPIO_FUNC0_IN_INV_SEL_V << GPIO_FUNC0_IN_INV_SEL_S)
#define GPIO_FUNC0_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC0_IN_INV_SEL_S  8
/** GPIO_SIG0_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG0_IN_SEL    (BIT(9))
#define GPIO_SIG0_IN_SEL_M  (GPIO_SIG0_IN_SEL_V << GPIO_SIG0_IN_SEL_S)
#define GPIO_SIG0_IN_SEL_V  0x00000001U
#define GPIO_SIG0_IN_SEL_S  9

/** GPIO_FUNC1_IN_SEL_CFG_REG register
 *  Configuration register for input signal 1
 */
#define GPIO_FUNC1_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x2f8)
/** GPIO_FUNC1_IN_SEL : R/W; bitpos: [7:0]; default: 128;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 1.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC1_IN_SEL    0x000000FFU
#define GPIO_FUNC1_IN_SEL_M  (GPIO_FUNC1_IN_SEL_V << GPIO_FUNC1_IN_SEL_S)
#define GPIO_FUNC1_IN_SEL_V  0x000000FFU
#define GPIO_FUNC1_IN_SEL_S  0
/** GPIO_FUNC1_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC1_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC1_IN_INV_SEL_M  (GPIO_FUNC1_IN_INV_SEL_V << GPIO_FUNC1_IN_INV_SEL_S)
#define GPIO_FUNC1_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC1_IN_INV_SEL_S  8
/** GPIO_SIG1_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG1_IN_SEL    (BIT(9))
#define GPIO_SIG1_IN_SEL_M  (GPIO_SIG1_IN_SEL_V << GPIO_SIG1_IN_SEL_S)
#define GPIO_SIG1_IN_SEL_V  0x00000001U
#define GPIO_SIG1_IN_SEL_S  9

/** GPIO_FUNC2_IN_SEL_CFG_REG register
 *  Configuration register for input signal 2
 */
#define GPIO_FUNC2_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x2fc)
/** GPIO_FUNC2_IN_SEL : R/W; bitpos: [7:0]; default: 128;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 2.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC2_IN_SEL    0x000000FFU
#define GPIO_FUNC2_IN_SEL_M  (GPIO_FUNC2_IN_SEL_V << GPIO_FUNC2_IN_SEL_S)
#define GPIO_FUNC2_IN_SEL_V  0x000000FFU
#define GPIO_FUNC2_IN_SEL_S  0
/** GPIO_FUNC2_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC2_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC2_IN_INV_SEL_M  (GPIO_FUNC2_IN_INV_SEL_V << GPIO_FUNC2_IN_INV_SEL_S)
#define GPIO_FUNC2_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC2_IN_INV_SEL_S  8
/** GPIO_SIG2_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG2_IN_SEL    (BIT(9))
#define GPIO_SIG2_IN_SEL_M  (GPIO_SIG2_IN_SEL_V << GPIO_SIG2_IN_SEL_S)
#define GPIO_SIG2_IN_SEL_V  0x00000001U
#define GPIO_SIG2_IN_SEL_S  9

