espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_reg.h
/** GPIO_FUNC207_IN_SEL_CFG_REG register
 *  Configuration register for input signal 207
 */
#define GPIO_FUNC207_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x630)
/** GPIO_FUNC207_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 207.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC207_IN_SEL    0x000000FFU
#define GPIO_FUNC207_IN_SEL_M  (GPIO_FUNC207_IN_SEL_V << GPIO_FUNC207_IN_SEL_S)
#define GPIO_FUNC207_IN_SEL_V  0x000000FFU
#define GPIO_FUNC207_IN_SEL_S  0
/** GPIO_FUNC207_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC207_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC207_IN_INV_SEL_M  (GPIO_FUNC207_IN_INV_SEL_V << GPIO_FUNC207_IN_INV_SEL_S)
#define GPIO_FUNC207_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC207_IN_INV_SEL_S  8
/** GPIO_SIG207_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG207_IN_SEL    (BIT(9))
#define GPIO_SIG207_IN_SEL_M  (GPIO_SIG207_IN_SEL_V << GPIO_SIG207_IN_SEL_S)
#define GPIO_SIG207_IN_SEL_V  0x00000001U
#define GPIO_SIG207_IN_SEL_S  9

/** GPIO_FUNC208_IN_SEL_CFG_REG register
 *  Configuration register for input signal 208
 */
#define GPIO_FUNC208_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x634)
/** GPIO_FUNC208_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 208.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC208_IN_SEL    0x000000FFU
#define GPIO_FUNC208_IN_SEL_M  (GPIO_FUNC208_IN_SEL_V << GPIO_FUNC208_IN_SEL_S)
#define GPIO_FUNC208_IN_SEL_V  0x000000FFU
#define GPIO_FUNC208_IN_SEL_S  0
/** GPIO_FUNC208_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC208_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC208_IN_INV_SEL_M  (GPIO_FUNC208_IN_INV_SEL_V << GPIO_FUNC208_IN_INV_SEL_S)
#define GPIO_FUNC208_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC208_IN_INV_SEL_S  8
/** GPIO_SIG208_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG208_IN_SEL    (BIT(9))
#define GPIO_SIG208_IN_SEL_M  (GPIO_SIG208_IN_SEL_V << GPIO_SIG208_IN_SEL_S)
#define GPIO_SIG208_IN_SEL_V  0x00000001U
#define GPIO_SIG208_IN_SEL_S  9

/** GPIO_FUNC209_IN_SEL_CFG_REG register
 *  Configuration register for input signal 209
 */
#define GPIO_FUNC209_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x638)
/** GPIO_FUNC209_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 209.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC209_IN_SEL    0x000000FFU
#define GPIO_FUNC209_IN_SEL_M  (GPIO_FUNC209_IN_SEL_V << GPIO_FUNC209_IN_SEL_S)
#define GPIO_FUNC209_IN_SEL_V  0x000000FFU
#define GPIO_FUNC209_IN_SEL_S  0
/** GPIO_FUNC209_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC209_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC209_IN_INV_SEL_M  (GPIO_FUNC209_IN_INV_SEL_V << GPIO_FUNC209_IN_INV_SEL_S)
#define GPIO_FUNC209_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC209_IN_INV_SEL_S  8
/** GPIO_SIG209_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG209_IN_SEL    (BIT(9))
#define GPIO_SIG209_IN_SEL_M  (GPIO_SIG209_IN_SEL_V << GPIO_SIG209_IN_SEL_S)
#define GPIO_SIG209_IN_SEL_V  0x00000001U
#define GPIO_SIG209_IN_SEL_S  9

/** GPIO_FUNC210_IN_SEL_CFG_REG register
 *  Configuration register for input signal 210
 */
#define GPIO_FUNC210_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x63c)
/** GPIO_FUNC210_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 210.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC210_IN_SEL    0x000000FFU
#define GPIO_FUNC210_IN_SEL_M  (GPIO_FUNC210_IN_SEL_V << GPIO_FUNC210_IN_SEL_S)
#define GPIO_FUNC210_IN_SEL_V  0x000000FFU
#define GPIO_FUNC210_IN_SEL_S  0
/** GPIO_FUNC210_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC210_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC210_IN_INV_SEL_M  (GPIO_FUNC210_IN_INV_SEL_V << GPIO_FUNC210_IN_INV_SEL_S)
#define GPIO_FUNC210_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC210_IN_INV_SEL_S  8
/** GPIO_SIG210_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG210_IN_SEL    (BIT(9))
#define GPIO_SIG210_IN_SEL_M  (GPIO_SIG210_IN_SEL_V << GPIO_SIG210_IN_SEL_S)
#define GPIO_SIG210_IN_SEL_V  0x00000001U
#define GPIO_SIG210_IN_SEL_S  9

/** GPIO_FUNC211_IN_SEL_CFG_REG register
 *  Configuration register for input signal 211
 */
#define GPIO_FUNC211_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x640)
/** GPIO_FUNC211_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 211.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC211_IN_SEL    0x000000FFU
#define GPIO_FUNC211_IN_SEL_M  (GPIO_FUNC211_IN_SEL_V << GPIO_FUNC211_IN_SEL_S)
#define GPIO_FUNC211_IN_SEL_V  0x000000FFU
#define GPIO_FUNC211_IN_SEL_S  0
/** GPIO_FUNC211_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC211_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC211_IN_INV_SEL_M  (GPIO_FUNC211_IN_INV_SEL_V << GPIO_FUNC211_IN_INV_SEL_S)
#define GPIO_FUNC211_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC211_IN_INV_SEL_S  8
/** GPIO_SIG211_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG211_IN_SEL    (BIT(9))
#define GPIO_SIG211_IN_SEL_M  (GPIO_SIG211_IN_SEL_V << GPIO_SIG211_IN_SEL_S)
#define GPIO_SIG211_IN_SEL_V  0x00000001U
#define GPIO_SIG211_IN_SEL_S  9

