espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_reg.h
/** GPIO_FUNC214_IN_SEL_CFG_REG register
 *  Configuration register for input signal 214
 */
#define GPIO_FUNC214_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x64c)
/** GPIO_FUNC214_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 214.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC214_IN_SEL    0x000000FFU
#define GPIO_FUNC214_IN_SEL_M  (GPIO_FUNC214_IN_SEL_V << GPIO_FUNC214_IN_SEL_S)
#define GPIO_FUNC214_IN_SEL_V  0x000000FFU
#define GPIO_FUNC214_IN_SEL_S  0
/** GPIO_FUNC214_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC214_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC214_IN_INV_SEL_M  (GPIO_FUNC214_IN_INV_SEL_V << GPIO_FUNC214_IN_INV_SEL_S)
#define GPIO_FUNC214_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC214_IN_INV_SEL_S  8
/** GPIO_SIG214_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG214_IN_SEL    (BIT(9))
#define GPIO_SIG214_IN_SEL_M  (GPIO_SIG214_IN_SEL_V << GPIO_SIG214_IN_SEL_S)
#define GPIO_SIG214_IN_SEL_V  0x00000001U
#define GPIO_SIG214_IN_SEL_S  9

/** GPIO_FUNC215_IN_SEL_CFG_REG register
 *  Configuration register for input signal 215
 */
#define GPIO_FUNC215_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x650)
/** GPIO_FUNC215_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 215.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC215_IN_SEL    0x000000FFU
#define GPIO_FUNC215_IN_SEL_M  (GPIO_FUNC215_IN_SEL_V << GPIO_FUNC215_IN_SEL_S)
#define GPIO_FUNC215_IN_SEL_V  0x000000FFU
#define GPIO_FUNC215_IN_SEL_S  0
/** GPIO_FUNC215_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC215_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC215_IN_INV_SEL_M  (GPIO_FUNC215_IN_INV_SEL_V << GPIO_FUNC215_IN_INV_SEL_S)
#define GPIO_FUNC215_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC215_IN_INV_SEL_S  8
/** GPIO_SIG215_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG215_IN_SEL    (BIT(9))
#define GPIO_SIG215_IN_SEL_M  (GPIO_SIG215_IN_SEL_V << GPIO_SIG215_IN_SEL_S)
#define GPIO_SIG215_IN_SEL_V  0x00000001U
#define GPIO_SIG215_IN_SEL_S  9

/** GPIO_FUNC216_IN_SEL_CFG_REG register
 *  Configuration register for input signal 216
 */
#define GPIO_FUNC216_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x654)
/** GPIO_FUNC216_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 216.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC216_IN_SEL    0x000000FFU
#define GPIO_FUNC216_IN_SEL_M  (GPIO_FUNC216_IN_SEL_V << GPIO_FUNC216_IN_SEL_S)
#define GPIO_FUNC216_IN_SEL_V  0x000000FFU
#define GPIO_FUNC216_IN_SEL_S  0
/** GPIO_FUNC216_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC216_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC216_IN_INV_SEL_M  (GPIO_FUNC216_IN_INV_SEL_V << GPIO_FUNC216_IN_INV_SEL_S)
#define GPIO_FUNC216_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC216_IN_INV_SEL_S  8
/** GPIO_SIG216_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG216_IN_SEL    (BIT(9))
#define GPIO_SIG216_IN_SEL_M  (GPIO_SIG216_IN_SEL_V << GPIO_SIG216_IN_SEL_S)
#define GPIO_SIG216_IN_SEL_V  0x00000001U
#define GPIO_SIG216_IN_SEL_S  9

/** GPIO_FUNC217_IN_SEL_CFG_REG register
 *  Configuration register for input signal 217
 */
#define GPIO_FUNC217_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x658)
/** GPIO_FUNC217_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 217.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC217_IN_SEL    0x000000FFU
#define GPIO_FUNC217_IN_SEL_M  (GPIO_FUNC217_IN_SEL_V << GPIO_FUNC217_IN_SEL_S)
#define GPIO_FUNC217_IN_SEL_V  0x000000FFU
#define GPIO_FUNC217_IN_SEL_S  0
/** GPIO_FUNC217_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC217_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC217_IN_INV_SEL_M  (GPIO_FUNC217_IN_INV_SEL_V << GPIO_FUNC217_IN_INV_SEL_S)
#define GPIO_FUNC217_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC217_IN_INV_SEL_S  8
/** GPIO_SIG217_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG217_IN_SEL    (BIT(9))
#define GPIO_SIG217_IN_SEL_M  (GPIO_SIG217_IN_SEL_V << GPIO_SIG217_IN_SEL_S)
#define GPIO_SIG217_IN_SEL_V  0x00000001U
#define GPIO_SIG217_IN_SEL_S  9

/** GPIO_FUNC218_IN_SEL_CFG_REG register
 *  Configuration register for input signal 218
 */
#define GPIO_FUNC218_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x65c)
/** GPIO_FUNC218_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 218.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC218_IN_SEL    0x000000FFU
#define GPIO_FUNC218_IN_SEL_M  (GPIO_FUNC218_IN_SEL_V << GPIO_FUNC218_IN_SEL_S)
#define GPIO_FUNC218_IN_SEL_V  0x000000FFU
#define GPIO_FUNC218_IN_SEL_S  0
/** GPIO_FUNC218_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC218_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC218_IN_INV_SEL_M  (GPIO_FUNC218_IN_INV_SEL_V << GPIO_FUNC218_IN_INV_SEL_S)
#define GPIO_FUNC218_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC218_IN_INV_SEL_S  8
/** GPIO_SIG218_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG218_IN_SEL    (BIT(9))
#define GPIO_SIG218_IN_SEL_M  (GPIO_SIG218_IN_SEL_V << GPIO_SIG218_IN_SEL_S)
#define GPIO_SIG218_IN_SEL_V  0x00000001U
#define GPIO_SIG218_IN_SEL_S  9

/** GPIO_FUNC219_IN_SEL_CFG_REG register
 *  Configuration register for input signal 219
 */
#define GPIO_FUNC219_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x660)
/** GPIO_FUNC219_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 219.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC219_IN_SEL    0x000000FFU
#define GPIO_FUNC219_IN_SEL_M  (GPIO_FUNC219_IN_SEL_V << GPIO_FUNC219_IN_SEL_S)
#define GPIO_FUNC219_IN_SEL_V  0x000000FFU
#define GPIO_FUNC219_IN_SEL_S  0
/** GPIO_FUNC219_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC219_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC219_IN_INV_SEL_M  (GPIO_FUNC219_IN_INV_SEL_V << GPIO_FUNC219_IN_INV_SEL_S)
#define GPIO_FUNC219_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC219_IN_INV_SEL_S  8
/** GPIO_SIG219_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG219_IN_SEL    (BIT(9))
#define GPIO_SIG219_IN_SEL_M  (GPIO_SIG219_IN_SEL_V << GPIO_SIG219_IN_SEL_S)
#define GPIO_SIG219_IN_SEL_V  0x00000001U
#define GPIO_SIG219_IN_SEL_S  9

/** GPIO_FUNC220_IN_SEL_CFG_REG register
 *  Configuration register for input signal 220
 */
#define GPIO_FUNC220_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x664)
/** GPIO_FUNC220_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 220.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC220_IN_SEL    0x000000FFU
#define GPIO_FUNC220_IN_SEL_M  (GPIO_FUNC220_IN_SEL_V << GPIO_FUNC220_IN_SEL_S)
#define GPIO_FUNC220_IN_SEL_V  0x000000FFU
#define GPIO_FUNC220_IN_SEL_S  0
/** GPIO_FUNC220_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC220_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC220_IN_INV_SEL_M  (GPIO_FUNC220_IN_INV_SEL_V << GPIO_FUNC220_IN_INV_SEL_S)
#define GPIO_FUNC220_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC220_IN_INV_SEL_S  8
/** GPIO_SIG220_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG220_IN_SEL    (BIT(9))
#define GPIO_SIG220_IN_SEL_M  (GPIO_SIG220_IN_SEL_V << GPIO_SIG220_IN_SEL_S)
#define GPIO_SIG220_IN_SEL_V  0x00000001U
#define GPIO_SIG220_IN_SEL_S  9

/** GPIO_FUNC221_IN_SEL_CFG_REG register
 *  Configuration register for input signal 221
 */
#define GPIO_FUNC221_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x668)
/** GPIO_FUNC221_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 221.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC221_IN_SEL    0x000000FFU
#define GPIO_FUNC221_IN_SEL_M  (GPIO_FUNC221_IN_SEL_V << GPIO_FUNC221_IN_SEL_S)
#define GPIO_FUNC221_IN_SEL_V  0x000000FFU
#define GPIO_FUNC221_IN_SEL_S  0
/** GPIO_FUNC221_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC221_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC221_IN_INV_SEL_M  (GPIO_FUNC221_IN_INV_SEL_V << GPIO_FUNC221_IN_INV_SEL_S)
#define GPIO_FUNC221_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC221_IN_INV_SEL_S  8
/** GPIO_SIG221_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG221_IN_SEL    (BIT(9))
#define GPIO_SIG221_IN_SEL_M  (GPIO_SIG221_IN_SEL_V << GPIO_SIG221_IN_SEL_S)
#define GPIO_SIG221_IN_SEL_V  0x00000001U
#define GPIO_SIG221_IN_SEL_S  9

/** GPIO_FUNC222_IN_SEL_CFG_REG register
 *  Configuration register for input signal 222
 */
#define GPIO_FUNC222_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x66c)
/** GPIO_FUNC222_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 222.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC222_IN_SEL    0x000000FFU
#define GPIO_FUNC222_IN_SEL_M  (GPIO_FUNC222_IN_SEL_V << GPIO_FUNC222_IN_SEL_S)
#define GPIO_FUNC222_IN_SEL_V  0x000000FFU
#define GPIO_FUNC222_IN_SEL_S  0
/** GPIO_FUNC222_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC222_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC222_IN_INV_SEL_M  (GPIO_FUNC222_IN_INV_SEL_V << GPIO_FUNC222_IN_INV_SEL_S)
#define GPIO_FUNC222_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC222_IN_INV_SEL_S  8
/** GPIO_SIG222_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG222_IN_SEL    (BIT(9))
#define GPIO_SIG222_IN_SEL_M  (GPIO_SIG222_IN_SEL_V << GPIO_SIG222_IN_SEL_S)
#define GPIO_SIG222_IN_SEL_V  0x00000001U
#define GPIO_SIG222_IN_SEL_S  9

