espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_reg.h
/** GPIO_FUNC228_IN_SEL_CFG_REG register
 *  Configuration register for input signal 228
 */
#define GPIO_FUNC228_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x684)
/** GPIO_FUNC228_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 228.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC228_IN_SEL    0x000000FFU
#define GPIO_FUNC228_IN_SEL_M  (GPIO_FUNC228_IN_SEL_V << GPIO_FUNC228_IN_SEL_S)
#define GPIO_FUNC228_IN_SEL_V  0x000000FFU
#define GPIO_FUNC228_IN_SEL_S  0
/** GPIO_FUNC228_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC228_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC228_IN_INV_SEL_M  (GPIO_FUNC228_IN_INV_SEL_V << GPIO_FUNC228_IN_INV_SEL_S)
#define GPIO_FUNC228_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC228_IN_INV_SEL_S  8
/** GPIO_SIG228_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG228_IN_SEL    (BIT(9))
#define GPIO_SIG228_IN_SEL_M  (GPIO_SIG228_IN_SEL_V << GPIO_SIG228_IN_SEL_S)
#define GPIO_SIG228_IN_SEL_V  0x00000001U
#define GPIO_SIG228_IN_SEL_S  9

/** GPIO_FUNC229_IN_SEL_CFG_REG register
 *  Configuration register for input signal 229
 */
#define GPIO_FUNC229_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x688)
/** GPIO_FUNC229_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 229.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC229_IN_SEL    0x000000FFU
#define GPIO_FUNC229_IN_SEL_M  (GPIO_FUNC229_IN_SEL_V << GPIO_FUNC229_IN_SEL_S)
#define GPIO_FUNC229_IN_SEL_V  0x000000FFU
#define GPIO_FUNC229_IN_SEL_S  0
/** GPIO_FUNC229_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC229_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC229_IN_INV_SEL_M  (GPIO_FUNC229_IN_INV_SEL_V << GPIO_FUNC229_IN_INV_SEL_S)
#define GPIO_FUNC229_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC229_IN_INV_SEL_S  8
/** GPIO_SIG229_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG229_IN_SEL    (BIT(9))
#define GPIO_SIG229_IN_SEL_M  (GPIO_SIG229_IN_SEL_V << GPIO_SIG229_IN_SEL_S)
#define GPIO_SIG229_IN_SEL_V  0x00000001U
#define GPIO_SIG229_IN_SEL_S  9

/** GPIO_FUNC230_IN_SEL_CFG_REG register
 *  Configuration register for input signal 230
 */
#define GPIO_FUNC230_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x68c)
/** GPIO_FUNC230_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 230.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC230_IN_SEL    0x000000FFU
#define GPIO_FUNC230_IN_SEL_M  (GPIO_FUNC230_IN_SEL_V << GPIO_FUNC230_IN_SEL_S)
#define GPIO_FUNC230_IN_SEL_V  0x000000FFU
#define GPIO_FUNC230_IN_SEL_S  0
/** GPIO_FUNC230_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC230_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC230_IN_INV_SEL_M  (GPIO_FUNC230_IN_INV_SEL_V << GPIO_FUNC230_IN_INV_SEL_S)
#define GPIO_FUNC230_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC230_IN_INV_SEL_S  8
/** GPIO_SIG230_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG230_IN_SEL    (BIT(9))
#define GPIO_SIG230_IN_SEL_M  (GPIO_SIG230_IN_SEL_V << GPIO_SIG230_IN_SEL_S)
#define GPIO_SIG230_IN_SEL_V  0x00000001U
#define GPIO_SIG230_IN_SEL_S  9

/** GPIO_FUNC231_IN_SEL_CFG_REG register
 *  Configuration register for input signal 231
 */
#define GPIO_FUNC231_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x690)
/** GPIO_FUNC231_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 231.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC231_IN_SEL    0x000000FFU
#define GPIO_FUNC231_IN_SEL_M  (GPIO_FUNC231_IN_SEL_V << GPIO_FUNC231_IN_SEL_S)
#define GPIO_FUNC231_IN_SEL_V  0x000000FFU
#define GPIO_FUNC231_IN_SEL_S  0
/** GPIO_FUNC231_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC231_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC231_IN_INV_SEL_M  (GPIO_FUNC231_IN_INV_SEL_V << GPIO_FUNC231_IN_INV_SEL_S)
#define GPIO_FUNC231_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC231_IN_INV_SEL_S  8
/** GPIO_SIG231_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG231_IN_SEL    (BIT(9))
#define GPIO_SIG231_IN_SEL_M  (GPIO_SIG231_IN_SEL_V << GPIO_SIG231_IN_SEL_S)
#define GPIO_SIG231_IN_SEL_V  0x00000001U
#define GPIO_SIG231_IN_SEL_S  9

/** GPIO_FUNC232_IN_SEL_CFG_REG register
 *  Configuration register for input signal 232
 */
#define GPIO_FUNC232_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x694)
/** GPIO_FUNC232_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 232.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC232_IN_SEL    0x000000FFU
#define GPIO_FUNC232_IN_SEL_M  (GPIO_FUNC232_IN_SEL_V << GPIO_FUNC232_IN_SEL_S)
#define GPIO_FUNC232_IN_SEL_V  0x000000FFU
#define GPIO_FUNC232_IN_SEL_S  0
/** GPIO_FUNC232_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC232_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC232_IN_INV_SEL_M  (GPIO_FUNC232_IN_INV_SEL_V << GPIO_FUNC232_IN_INV_SEL_S)
#define GPIO_FUNC232_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC232_IN_INV_SEL_S  8
/** GPIO_SIG232_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG232_IN_SEL    (BIT(9))
#define GPIO_SIG232_IN_SEL_M  (GPIO_SIG232_IN_SEL_V << GPIO_SIG232_IN_SEL_S)
#define GPIO_SIG232_IN_SEL_V  0x00000001U
#define GPIO_SIG232_IN_SEL_S  9

/** GPIO_FUNC233_IN_SEL_CFG_REG register
 *  Configuration register for input signal 233
 */
#define GPIO_FUNC233_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x698)
/** GPIO_FUNC233_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 233.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC233_IN_SEL    0x000000FFU
#define GPIO_FUNC233_IN_SEL_M  (GPIO_FUNC233_IN_SEL_V << GPIO_FUNC233_IN_SEL_S)
#define GPIO_FUNC233_IN_SEL_V  0x000000FFU
#define GPIO_FUNC233_IN_SEL_S  0
/** GPIO_FUNC233_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC233_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC233_IN_INV_SEL_M  (GPIO_FUNC233_IN_INV_SEL_V << GPIO_FUNC233_IN_INV_SEL_S)
#define GPIO_FUNC233_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC233_IN_INV_SEL_S  8
/** GPIO_SIG233_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG233_IN_SEL    (BIT(9))
#define GPIO_SIG233_IN_SEL_M  (GPIO_SIG233_IN_SEL_V << GPIO_SIG233_IN_SEL_S)
#define GPIO_SIG233_IN_SEL_V  0x00000001U
#define GPIO_SIG233_IN_SEL_S  9

/** GPIO_FUNC234_IN_SEL_CFG_REG register
 *  Configuration register for input signal 234
 */
#define GPIO_FUNC234_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x69c)
/** GPIO_FUNC234_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 234.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC234_IN_SEL    0x000000FFU
#define GPIO_FUNC234_IN_SEL_M  (GPIO_FUNC234_IN_SEL_V << GPIO_FUNC234_IN_SEL_S)
#define GPIO_FUNC234_IN_SEL_V  0x000000FFU
#define GPIO_FUNC234_IN_SEL_S  0
/** GPIO_FUNC234_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC234_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC234_IN_INV_SEL_M  (GPIO_FUNC234_IN_INV_SEL_V << GPIO_FUNC234_IN_INV_SEL_S)
#define GPIO_FUNC234_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC234_IN_INV_SEL_S  8
/** GPIO_SIG234_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG234_IN_SEL    (BIT(9))
#define GPIO_SIG234_IN_SEL_M  (GPIO_SIG234_IN_SEL_V << GPIO_SIG234_IN_SEL_S)
#define GPIO_SIG234_IN_SEL_V  0x00000001U
#define GPIO_SIG234_IN_SEL_S  9

/** GPIO_FUNC235_IN_SEL_CFG_REG register
 *  Configuration register for input signal 235
 */
#define GPIO_FUNC235_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x6a0)
/** GPIO_FUNC235_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 235.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC235_IN_SEL    0x000000FFU
#define GPIO_FUNC235_IN_SEL_M  (GPIO_FUNC235_IN_SEL_V << GPIO_FUNC235_IN_SEL_S)
#define GPIO_FUNC235_IN_SEL_V  0x000000FFU
#define GPIO_FUNC235_IN_SEL_S  0
/** GPIO_FUNC235_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC235_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC235_IN_INV_SEL_M  (GPIO_FUNC235_IN_INV_SEL_V << GPIO_FUNC235_IN_INV_SEL_S)
#define GPIO_FUNC235_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC235_IN_INV_SEL_S  8
/** GPIO_SIG235_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG235_IN_SEL    (BIT(9))
#define GPIO_SIG235_IN_SEL_M  (GPIO_SIG235_IN_SEL_V << GPIO_SIG235_IN_SEL_S)
#define GPIO_SIG235_IN_SEL_V  0x00000001U
#define GPIO_SIG235_IN_SEL_S  9

/** GPIO_FUNC236_IN_SEL_CFG_REG register
 *  Configuration register for input signal 236
 */
#define GPIO_FUNC236_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x6a4)
/** GPIO_FUNC236_IN_SEL : R/W; bitpos: [7:0]; default: 192;
 *  Configures to select a pin from the 63 GPIO pins to connect the input signal 236.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  61: Select GPIO61
 *  62: Select GPIO62
 *  Or
 *  0x80: A constantly high input
 *  0xc0: A constantly low input
 */
#define GPIO_FUNC236_IN_SEL    0x000000FFU
#define GPIO_FUNC236_IN_SEL_M  (GPIO_FUNC236_IN_SEL_V << GPIO_FUNC236_IN_SEL_S)
#define GPIO_FUNC236_IN_SEL_V  0x000000FFU
#define GPIO_FUNC236_IN_SEL_S  0
/** GPIO_FUNC236_IN_INV_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC236_IN_INV_SEL    (BIT(8))
#define GPIO_FUNC236_IN_INV_SEL_M  (GPIO_FUNC236_IN_INV_SEL_V << GPIO_FUNC236_IN_INV_SEL_S)
#define GPIO_FUNC236_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC236_IN_INV_SEL_S  8
/** GPIO_SIG236_IN_SEL : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG236_IN_SEL    (BIT(9))
#define GPIO_SIG236_IN_SEL_M  (GPIO_SIG236_IN_SEL_V << GPIO_SIG236_IN_SEL_S)
#define GPIO_SIG236_IN_SEL_V  0x00000001U
#define GPIO_SIG236_IN_SEL_S  9

