espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_reg.h
/** GPIO_FUNC48_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO48 output
 */
#define GPIO_FUNC48_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbb4)
/** GPIO_FUNC48_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO48.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 48 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC48_OUT_SEL    0x000001FFU
#define GPIO_FUNC48_OUT_SEL_M  (GPIO_FUNC48_OUT_SEL_V << GPIO_FUNC48_OUT_SEL_S)
#define GPIO_FUNC48_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC48_OUT_SEL_S  0
/** GPIO_FUNC48_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC48_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC48_OUT_INV_SEL_M  (GPIO_FUNC48_OUT_INV_SEL_V << GPIO_FUNC48_OUT_INV_SEL_S)
#define GPIO_FUNC48_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC48_OUT_INV_SEL_S  9
/** GPIO_FUNC48_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 48 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC48_OE_SEL    (BIT(10))
#define GPIO_FUNC48_OE_SEL_M  (GPIO_FUNC48_OE_SEL_V << GPIO_FUNC48_OE_SEL_S)
#define GPIO_FUNC48_OE_SEL_V  0x00000001U
#define GPIO_FUNC48_OE_SEL_S  10
/** GPIO_FUNC48_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC48_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC48_OE_INV_SEL_M  (GPIO_FUNC48_OE_INV_SEL_V << GPIO_FUNC48_OE_INV_SEL_S)
#define GPIO_FUNC48_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC48_OE_INV_SEL_S  11

/** GPIO_FUNC49_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO49 output
 */
#define GPIO_FUNC49_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbb8)
/** GPIO_FUNC49_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO49.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 49 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC49_OUT_SEL    0x000001FFU
#define GPIO_FUNC49_OUT_SEL_M  (GPIO_FUNC49_OUT_SEL_V << GPIO_FUNC49_OUT_SEL_S)
#define GPIO_FUNC49_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC49_OUT_SEL_S  0
/** GPIO_FUNC49_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC49_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC49_OUT_INV_SEL_M  (GPIO_FUNC49_OUT_INV_SEL_V << GPIO_FUNC49_OUT_INV_SEL_S)
#define GPIO_FUNC49_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC49_OUT_INV_SEL_S  9
/** GPIO_FUNC49_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 49 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC49_OE_SEL    (BIT(10))
#define GPIO_FUNC49_OE_SEL_M  (GPIO_FUNC49_OE_SEL_V << GPIO_FUNC49_OE_SEL_S)
#define GPIO_FUNC49_OE_SEL_V  0x00000001U
#define GPIO_FUNC49_OE_SEL_S  10
/** GPIO_FUNC49_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC49_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC49_OE_INV_SEL_M  (GPIO_FUNC49_OE_INV_SEL_V << GPIO_FUNC49_OE_INV_SEL_S)
#define GPIO_FUNC49_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC49_OE_INV_SEL_S  11

/** GPIO_FUNC50_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO50 output
 */
#define GPIO_FUNC50_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbbc)
/** GPIO_FUNC50_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO50.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 50 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC50_OUT_SEL    0x000001FFU
#define GPIO_FUNC50_OUT_SEL_M  (GPIO_FUNC50_OUT_SEL_V << GPIO_FUNC50_OUT_SEL_S)
#define GPIO_FUNC50_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC50_OUT_SEL_S  0
/** GPIO_FUNC50_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC50_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC50_OUT_INV_SEL_M  (GPIO_FUNC50_OUT_INV_SEL_V << GPIO_FUNC50_OUT_INV_SEL_S)
#define GPIO_FUNC50_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC50_OUT_INV_SEL_S  9
/** GPIO_FUNC50_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 50 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC50_OE_SEL    (BIT(10))
#define GPIO_FUNC50_OE_SEL_M  (GPIO_FUNC50_OE_SEL_V << GPIO_FUNC50_OE_SEL_S)
#define GPIO_FUNC50_OE_SEL_V  0x00000001U
#define GPIO_FUNC50_OE_SEL_S  10
/** GPIO_FUNC50_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC50_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC50_OE_INV_SEL_M  (GPIO_FUNC50_OE_INV_SEL_V << GPIO_FUNC50_OE_INV_SEL_S)
#define GPIO_FUNC50_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC50_OE_INV_SEL_S  11

/** GPIO_FUNC51_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO51 output
 */
#define GPIO_FUNC51_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbc0)
/** GPIO_FUNC51_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO51.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 51 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC51_OUT_SEL    0x000001FFU
#define GPIO_FUNC51_OUT_SEL_M  (GPIO_FUNC51_OUT_SEL_V << GPIO_FUNC51_OUT_SEL_S)
#define GPIO_FUNC51_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC51_OUT_SEL_S  0
/** GPIO_FUNC51_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC51_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC51_OUT_INV_SEL_M  (GPIO_FUNC51_OUT_INV_SEL_V << GPIO_FUNC51_OUT_INV_SEL_S)
#define GPIO_FUNC51_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC51_OUT_INV_SEL_S  9
/** GPIO_FUNC51_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 51 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC51_OE_SEL    (BIT(10))
#define GPIO_FUNC51_OE_SEL_M  (GPIO_FUNC51_OE_SEL_V << GPIO_FUNC51_OE_SEL_S)
#define GPIO_FUNC51_OE_SEL_V  0x00000001U
#define GPIO_FUNC51_OE_SEL_S  10
/** GPIO_FUNC51_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC51_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC51_OE_INV_SEL_M  (GPIO_FUNC51_OE_INV_SEL_V << GPIO_FUNC51_OE_INV_SEL_S)
#define GPIO_FUNC51_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC51_OE_INV_SEL_S  11

/** GPIO_FUNC52_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO52 output
 */
#define GPIO_FUNC52_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbc4)
/** GPIO_FUNC52_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO52.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 52 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC52_OUT_SEL    0x000001FFU
#define GPIO_FUNC52_OUT_SEL_M  (GPIO_FUNC52_OUT_SEL_V << GPIO_FUNC52_OUT_SEL_S)
#define GPIO_FUNC52_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC52_OUT_SEL_S  0
/** GPIO_FUNC52_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC52_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC52_OUT_INV_SEL_M  (GPIO_FUNC52_OUT_INV_SEL_V << GPIO_FUNC52_OUT_INV_SEL_S)
#define GPIO_FUNC52_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC52_OUT_INV_SEL_S  9
/** GPIO_FUNC52_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 52 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC52_OE_SEL    (BIT(10))
#define GPIO_FUNC52_OE_SEL_M  (GPIO_FUNC52_OE_SEL_V << GPIO_FUNC52_OE_SEL_S)
#define GPIO_FUNC52_OE_SEL_V  0x00000001U
#define GPIO_FUNC52_OE_SEL_S  10
/** GPIO_FUNC52_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC52_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC52_OE_INV_SEL_M  (GPIO_FUNC52_OE_INV_SEL_V << GPIO_FUNC52_OE_INV_SEL_S)
#define GPIO_FUNC52_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC52_OE_INV_SEL_S  11

/** GPIO_FUNC53_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO53 output
 */
#define GPIO_FUNC53_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbc8)
/** GPIO_FUNC53_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO53.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 53 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC53_OUT_SEL    0x000001FFU
#define GPIO_FUNC53_OUT_SEL_M  (GPIO_FUNC53_OUT_SEL_V << GPIO_FUNC53_OUT_SEL_S)
#define GPIO_FUNC53_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC53_OUT_SEL_S  0
/** GPIO_FUNC53_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC53_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC53_OUT_INV_SEL_M  (GPIO_FUNC53_OUT_INV_SEL_V << GPIO_FUNC53_OUT_INV_SEL_S)
#define GPIO_FUNC53_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC53_OUT_INV_SEL_S  9
/** GPIO_FUNC53_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 53 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC53_OE_SEL    (BIT(10))
#define GPIO_FUNC53_OE_SEL_M  (GPIO_FUNC53_OE_SEL_V << GPIO_FUNC53_OE_SEL_S)
#define GPIO_FUNC53_OE_SEL_V  0x00000001U
#define GPIO_FUNC53_OE_SEL_S  10
/** GPIO_FUNC53_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC53_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC53_OE_INV_SEL_M  (GPIO_FUNC53_OE_INV_SEL_V << GPIO_FUNC53_OE_INV_SEL_S)
#define GPIO_FUNC53_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC53_OE_INV_SEL_S  11

/** GPIO_FUNC54_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO54 output
 */
#define GPIO_FUNC54_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbcc)
/** GPIO_FUNC54_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO54.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 54 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC54_OUT_SEL    0x000001FFU
#define GPIO_FUNC54_OUT_SEL_M  (GPIO_FUNC54_OUT_SEL_V << GPIO_FUNC54_OUT_SEL_S)
#define GPIO_FUNC54_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC54_OUT_SEL_S  0
/** GPIO_FUNC54_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC54_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC54_OUT_INV_SEL_M  (GPIO_FUNC54_OUT_INV_SEL_V << GPIO_FUNC54_OUT_INV_SEL_S)
#define GPIO_FUNC54_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC54_OUT_INV_SEL_S  9
/** GPIO_FUNC54_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 54 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC54_OE_SEL    (BIT(10))
#define GPIO_FUNC54_OE_SEL_M  (GPIO_FUNC54_OE_SEL_V << GPIO_FUNC54_OE_SEL_S)
#define GPIO_FUNC54_OE_SEL_V  0x00000001U
#define GPIO_FUNC54_OE_SEL_S  10
/** GPIO_FUNC54_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC54_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC54_OE_INV_SEL_M  (GPIO_FUNC54_OE_INV_SEL_V << GPIO_FUNC54_OE_INV_SEL_S)
#define GPIO_FUNC54_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC54_OE_INV_SEL_S  11

