espressif/esp-idf/components/soc/esp32s31/register/soc/gpio_reg.h
/** GPIO_FUNC55_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO55 output
 */
#define GPIO_FUNC55_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbd0)
/** GPIO_FUNC55_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO55.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 55 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC55_OUT_SEL    0x000001FFU
#define GPIO_FUNC55_OUT_SEL_M  (GPIO_FUNC55_OUT_SEL_V << GPIO_FUNC55_OUT_SEL_S)
#define GPIO_FUNC55_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC55_OUT_SEL_S  0
/** GPIO_FUNC55_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC55_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC55_OUT_INV_SEL_M  (GPIO_FUNC55_OUT_INV_SEL_V << GPIO_FUNC55_OUT_INV_SEL_S)
#define GPIO_FUNC55_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC55_OUT_INV_SEL_S  9
/** GPIO_FUNC55_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 55 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC55_OE_SEL    (BIT(10))
#define GPIO_FUNC55_OE_SEL_M  (GPIO_FUNC55_OE_SEL_V << GPIO_FUNC55_OE_SEL_S)
#define GPIO_FUNC55_OE_SEL_V  0x00000001U
#define GPIO_FUNC55_OE_SEL_S  10
/** GPIO_FUNC55_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC55_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC55_OE_INV_SEL_M  (GPIO_FUNC55_OE_INV_SEL_V << GPIO_FUNC55_OE_INV_SEL_S)
#define GPIO_FUNC55_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC55_OE_INV_SEL_S  11

/** GPIO_FUNC56_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO56 output
 */
#define GPIO_FUNC56_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbd4)
/** GPIO_FUNC56_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO56.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 56 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC56_OUT_SEL    0x000001FFU
#define GPIO_FUNC56_OUT_SEL_M  (GPIO_FUNC56_OUT_SEL_V << GPIO_FUNC56_OUT_SEL_S)
#define GPIO_FUNC56_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC56_OUT_SEL_S  0
/** GPIO_FUNC56_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC56_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC56_OUT_INV_SEL_M  (GPIO_FUNC56_OUT_INV_SEL_V << GPIO_FUNC56_OUT_INV_SEL_S)
#define GPIO_FUNC56_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC56_OUT_INV_SEL_S  9
/** GPIO_FUNC56_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 56 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC56_OE_SEL    (BIT(10))
#define GPIO_FUNC56_OE_SEL_M  (GPIO_FUNC56_OE_SEL_V << GPIO_FUNC56_OE_SEL_S)
#define GPIO_FUNC56_OE_SEL_V  0x00000001U
#define GPIO_FUNC56_OE_SEL_S  10
/** GPIO_FUNC56_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC56_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC56_OE_INV_SEL_M  (GPIO_FUNC56_OE_INV_SEL_V << GPIO_FUNC56_OE_INV_SEL_S)
#define GPIO_FUNC56_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC56_OE_INV_SEL_S  11

/** GPIO_FUNC57_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO57 output
 */
#define GPIO_FUNC57_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbd8)
/** GPIO_FUNC57_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO57.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 57 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC57_OUT_SEL    0x000001FFU
#define GPIO_FUNC57_OUT_SEL_M  (GPIO_FUNC57_OUT_SEL_V << GPIO_FUNC57_OUT_SEL_S)
#define GPIO_FUNC57_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC57_OUT_SEL_S  0
/** GPIO_FUNC57_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC57_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC57_OUT_INV_SEL_M  (GPIO_FUNC57_OUT_INV_SEL_V << GPIO_FUNC57_OUT_INV_SEL_S)
#define GPIO_FUNC57_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC57_OUT_INV_SEL_S  9
/** GPIO_FUNC57_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 57 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC57_OE_SEL    (BIT(10))
#define GPIO_FUNC57_OE_SEL_M  (GPIO_FUNC57_OE_SEL_V << GPIO_FUNC57_OE_SEL_S)
#define GPIO_FUNC57_OE_SEL_V  0x00000001U
#define GPIO_FUNC57_OE_SEL_S  10
/** GPIO_FUNC57_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC57_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC57_OE_INV_SEL_M  (GPIO_FUNC57_OE_INV_SEL_V << GPIO_FUNC57_OE_INV_SEL_S)
#define GPIO_FUNC57_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC57_OE_INV_SEL_S  11

/** GPIO_FUNC58_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO58 output
 */
#define GPIO_FUNC58_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbdc)
/** GPIO_FUNC58_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO58.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 58 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC58_OUT_SEL    0x000001FFU
#define GPIO_FUNC58_OUT_SEL_M  (GPIO_FUNC58_OUT_SEL_V << GPIO_FUNC58_OUT_SEL_S)
#define GPIO_FUNC58_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC58_OUT_SEL_S  0
/** GPIO_FUNC58_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC58_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC58_OUT_INV_SEL_M  (GPIO_FUNC58_OUT_INV_SEL_V << GPIO_FUNC58_OUT_INV_SEL_S)
#define GPIO_FUNC58_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC58_OUT_INV_SEL_S  9
/** GPIO_FUNC58_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 58 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC58_OE_SEL    (BIT(10))
#define GPIO_FUNC58_OE_SEL_M  (GPIO_FUNC58_OE_SEL_V << GPIO_FUNC58_OE_SEL_S)
#define GPIO_FUNC58_OE_SEL_V  0x00000001U
#define GPIO_FUNC58_OE_SEL_S  10
/** GPIO_FUNC58_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC58_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC58_OE_INV_SEL_M  (GPIO_FUNC58_OE_INV_SEL_V << GPIO_FUNC58_OE_INV_SEL_S)
#define GPIO_FUNC58_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC58_OE_INV_SEL_S  11

/** GPIO_FUNC59_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO59 output
 */
#define GPIO_FUNC59_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbe0)
/** GPIO_FUNC59_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO59.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 59 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC59_OUT_SEL    0x000001FFU
#define GPIO_FUNC59_OUT_SEL_M  (GPIO_FUNC59_OUT_SEL_V << GPIO_FUNC59_OUT_SEL_S)
#define GPIO_FUNC59_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC59_OUT_SEL_S  0
/** GPIO_FUNC59_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC59_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC59_OUT_INV_SEL_M  (GPIO_FUNC59_OUT_INV_SEL_V << GPIO_FUNC59_OUT_INV_SEL_S)
#define GPIO_FUNC59_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC59_OUT_INV_SEL_S  9
/** GPIO_FUNC59_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 59 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC59_OE_SEL    (BIT(10))
#define GPIO_FUNC59_OE_SEL_M  (GPIO_FUNC59_OE_SEL_V << GPIO_FUNC59_OE_SEL_S)
#define GPIO_FUNC59_OE_SEL_V  0x00000001U
#define GPIO_FUNC59_OE_SEL_S  10
/** GPIO_FUNC59_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC59_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC59_OE_INV_SEL_M  (GPIO_FUNC59_OE_INV_SEL_V << GPIO_FUNC59_OE_INV_SEL_S)
#define GPIO_FUNC59_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC59_OE_INV_SEL_S  11

/** GPIO_FUNC60_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO60 output
 */
#define GPIO_FUNC60_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbe4)
/** GPIO_FUNC60_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO60.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 60 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC60_OUT_SEL    0x000001FFU
#define GPIO_FUNC60_OUT_SEL_M  (GPIO_FUNC60_OUT_SEL_V << GPIO_FUNC60_OUT_SEL_S)
#define GPIO_FUNC60_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC60_OUT_SEL_S  0
/** GPIO_FUNC60_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC60_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC60_OUT_INV_SEL_M  (GPIO_FUNC60_OUT_INV_SEL_V << GPIO_FUNC60_OUT_INV_SEL_S)
#define GPIO_FUNC60_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC60_OUT_INV_SEL_S  9
/** GPIO_FUNC60_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 60 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC60_OE_SEL    (BIT(10))
#define GPIO_FUNC60_OE_SEL_M  (GPIO_FUNC60_OE_SEL_V << GPIO_FUNC60_OE_SEL_S)
#define GPIO_FUNC60_OE_SEL_V  0x00000001U
#define GPIO_FUNC60_OE_SEL_S  10
/** GPIO_FUNC60_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC60_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC60_OE_INV_SEL_M  (GPIO_FUNC60_OE_INV_SEL_V << GPIO_FUNC60_OE_INV_SEL_S)
#define GPIO_FUNC60_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC60_OE_INV_SEL_S  11

/** GPIO_FUNC61_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO61 output
 */
#define GPIO_FUNC61_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbe8)
/** GPIO_FUNC61_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO61.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 61 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC61_OUT_SEL    0x000001FFU
#define GPIO_FUNC61_OUT_SEL_M  (GPIO_FUNC61_OUT_SEL_V << GPIO_FUNC61_OUT_SEL_S)
#define GPIO_FUNC61_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC61_OUT_SEL_S  0
/** GPIO_FUNC61_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC61_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC61_OUT_INV_SEL_M  (GPIO_FUNC61_OUT_INV_SEL_V << GPIO_FUNC61_OUT_INV_SEL_S)
#define GPIO_FUNC61_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC61_OUT_INV_SEL_S  9
/** GPIO_FUNC61_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 61 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC61_OE_SEL    (BIT(10))
#define GPIO_FUNC61_OE_SEL_M  (GPIO_FUNC61_OE_SEL_V << GPIO_FUNC61_OE_SEL_S)
#define GPIO_FUNC61_OE_SEL_V  0x00000001U
#define GPIO_FUNC61_OE_SEL_S  10
/** GPIO_FUNC61_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC61_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC61_OE_INV_SEL_M  (GPIO_FUNC61_OE_INV_SEL_V << GPIO_FUNC61_OE_INV_SEL_S)
#define GPIO_FUNC61_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC61_OE_INV_SEL_S  11

/** GPIO_FUNC62_OUT_SEL_CFG_REG register
 *  Configuration register for GPIO62 output
 */
#define GPIO_FUNC62_OUT_SEL_CFG_REG (DR_REG_GPIO_BASE + 0xbec)
/** GPIO_FUNC62_OUT_SEL : R/W/SC; bitpos: [8:0]; default: 256;
 *  Configures to select a signal $Y (0 <= $Y < 256) from 256 peripheral signals to be
 *  output from GPIO62.
 *  0: Select signal 0
 *  1: Select signal 1
 *  ......
 *  254: Select signal 254
 *  255: Select signal 255
 *  Or
 *  256: Bit 62 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value
 *  and output enable.
 *
 *  For the detailed signal list, see Table .
 *  "
 */
#define GPIO_FUNC62_OUT_SEL    0x000001FFU
#define GPIO_FUNC62_OUT_SEL_M  (GPIO_FUNC62_OUT_SEL_V << GPIO_FUNC62_OUT_SEL_S)
#define GPIO_FUNC62_OUT_SEL_V  0x000001FFU
#define GPIO_FUNC62_OUT_SEL_S  0
/** GPIO_FUNC62_OUT_INV_SEL : R/W/SC; bitpos: [9]; default: 0;
 *  Configures whether or not to invert the output value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC62_OUT_INV_SEL    (BIT(9))
#define GPIO_FUNC62_OUT_INV_SEL_M  (GPIO_FUNC62_OUT_INV_SEL_V << GPIO_FUNC62_OUT_INV_SEL_S)
#define GPIO_FUNC62_OUT_INV_SEL_V  0x00000001U
#define GPIO_FUNC62_OUT_INV_SEL_S  9
/** GPIO_FUNC62_OE_SEL : R/W; bitpos: [10]; default: 0;
 *  Configures to select the source of output enable signal.
 *  0: Use output enable signal from peripheral.
 *  1: Force the output enable signal to be sourced from bit 62 of GPIO_ENABLE_REG.
 */
#define GPIO_FUNC62_OE_SEL    (BIT(10))
#define GPIO_FUNC62_OE_SEL_M  (GPIO_FUNC62_OE_SEL_V << GPIO_FUNC62_OE_SEL_S)
#define GPIO_FUNC62_OE_SEL_V  0x00000001U
#define GPIO_FUNC62_OE_SEL_S  10
/** GPIO_FUNC62_OE_INV_SEL : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to invert the output enable signal.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC62_OE_INV_SEL    (BIT(11))
#define GPIO_FUNC62_OE_INV_SEL_M  (GPIO_FUNC62_OE_INV_SEL_V << GPIO_FUNC62_OE_INV_SEL_S)
#define GPIO_FUNC62_OE_INV_SEL_V  0x00000001U
#define GPIO_FUNC62_OE_INV_SEL_S  11

/** GPIO_CLOCK_GATE_REG register
 *  GPIO clock gate register
 */
#define GPIO_CLOCK_GATE_REG (DR_REG_GPIO_BASE + 0xdf8)
/** GPIO_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether or not to enable clock gate.
 *  0: Not enable
 *  1: Enable, the clock is free running.
 */
#define GPIO_CLK_EN    (BIT(0))
#define GPIO_CLK_EN_M  (GPIO_CLK_EN_V << GPIO_CLK_EN_S)
#define GPIO_CLK_EN_V  0x00000001U
#define GPIO_CLK_EN_S  0

/** GPIO_DATE_REG register
 *  GPIO version register
 */
#define GPIO_DATE_REG (DR_REG_GPIO_BASE + 0xdfc)
/** GPIO_DATE : R/W; bitpos: [27:0]; default: 38830416;
 *  Version control register.
 */
#define GPIO_DATE    0x0FFFFFFFU
#define GPIO_DATE_M  (GPIO_DATE_V << GPIO_DATE_S)
#define GPIO_DATE_V  0x0FFFFFFFU
#define GPIO_DATE_S  0

#ifdef __cplusplus
}
#endif
